[{"title": "[FO] 33 tiny artworks and counting! My goal at the moment is 100!", "score": 775, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.0}, {"title": "Well, when you put it that way...", "score": 422, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.2732}, {"title": "I did my first craft fair today c: I wasn't busy at all (maybe 50 people in attendance), but I sold more than I could have ever hoped for!", "score": 1243, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6533}, {"title": "Took as long to make the blanket as it did to make the baby!", "score": 586, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Obituary — NPR books editor Petra Mayer has died", "score": 978, "body": "", "subreddit": "r/books", "user_reports": [], "compound": -0.5574}, {"title": "Mom, I had a really hard week. I’ve been sober for 11.5 months and I think I might relapse today.", "score": 738, "body": "It started with family drama on Sunday and Monday. I’m very private but shared some personal stuff about my open relationship and upcoming divorce with my mom. Who went and immediately told my dad, who didn’t know about my open relationship at all and called me upset and told me how disappointed he was. My mom apologized and I forgave her but I don’t feel supported by either of them, obviously.\n\nI saw friends later in the week and had a good time, but then it turned out we had forgotten my friend’s birthday and she was really upset. I tried to apologize and figure out how to make it better. I’m still trying but I’m having a hard time. I want to be a good friend but I don’t feel like I have much to give right now.\n\nMy boyfriend and I were supposed to have a fun day together on Friday since I took the day off. He suggested massages and then the movies. But he didn’t find any place that could do massages on Friday in time. I did, but he said they were too expensive and cancelled them. He tried to book another place but booked the wrong day so he cancelled those too. At the last minute he said we could re-book the expensive place but of course they couldn’t do it anymore. He also didn’t get any movie tickets like he said he would. I told him I really could have used a day of quality time and felt upset that he didn’t follow through on what he said he would do. He ignored me. I told him I didn’t feel supported by him and I really needed it. He ignored me again. This man is 40 years old and we have been dating for over 4 years. I don’t think I’ll ever get the support I need from him.\n\nSo I’m at my soon-to-be ex-husband’s apartment by myself with the cats I abandoned to live with my new boyfriend. I can’t think of anything to do to feel better except sleep or drink. And I already slept like 16 of the last 24 hours.\n\nI might just go to the store and get a bottle of booze. I don’t know what else to do.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": -0.1761}, {"title": "Why do people care about federal laws on social issues like weed or abortion?", "score": 67, "body": "I understand that this isn't feasible for someone if they think that abortion is murder. It's kind of like \"why not let people own slaves in their own state\" that's why this question is mostly for people who perceive these issues as largely subjective and are concerned about the utilitarian aspect of the policies.\n\nIf states have the opportunity to run diverse sets of laws that the majority of people in those states want to live under then why not let them run their own experiment in order to find out more about the policy and its outcomes. Is the principle certainty that the policy will work better for every state or is it just a deontological belief about freedom or something else I'm missing?", "subreddit": "r/PoliticalDiscussion", "user_reports": [], "compound": 0.6908}, {"title": "Picture explains itself.", "score": 260, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "It’s my birthday weekend. My fiancé took me to the local amusement park and it all just went terribly. I decided to get a caricature for the first time and I feel so gross.", "score": 255, "body": "", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": -0.7262}, {"title": "People of Melbourne have risen up", "score": 2001, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Hundreds of shoes and handwritten notes at a California school representing the children who will be leaving if the vaccine mandate becomes a requirement to attend school", "score": 2616, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Ron Paul was right", "score": 1574, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Finished up another sweater!", "score": 1493, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Anna Karenina. Damn.", "score": 1749, "body": "Just finished part one, and don’t wish to have it spoiled but just need a place to let out what I feel so far. This is truly the greatest novel I have ever read and I’m glad I waited till now that I’m in my later 40s. I feel as though I can appreciate it more. I’m amazed at how Tolstoy is able to describe the slight loss of love that happens after a new infatuation.  When Anna returns from Moscow and describes how her husbands ears seem weird and even describes her own child slightly less glowing as before she went to Moscow.  As someone whom has lived life and experienced similar things, I read that and realize the human condition is and has been the same throughout history. This is truly the best thing I’ve read in my life so far !", "subreddit": "r/books", "user_reports": [], "compound": -0.4019}, {"title": "Fauci Issues Urgent Warning to Vaccinated: “They are seeing a waning of immunity not only against infection but against hospitalization & to some extent death which is starting to now involve all age groups (not) just the elderly..ppl (are) getting breakthrough infections (&) winding up in hospital\"", "score": 2324, "body": "https://news.yahoo.com/dr-fauci-just-issued-urgent-201846228.html\n\n>On Nov. 12, White House COVID adviser Anthony Fauci, MD, went on The New York Times' podcast The Daily to discuss the current state of the coronavirus **in the U.S. According to Fauci, officials are now starting to see some waning immunity against both infection and hospitalization several months after initial vaccination.** The infectious disease expert pointed toward incoming data from Israel, which he noted tends to be about a month to a month and a half ahead of us in terms of the outbreak.\n\n>**”They are seeing a waning of immunity not only against infection but against hospitalization and to some extent death, which is starting to now involve all age groups. It isn't just the elderly,\" Fauci said. \"It's waning to the point that you're seeing more and more people getting breakthrough infections, and more and more of those people who are getting breakthrough infections are winding up in the hospital.”**\n\n>**Fauci went on to say, \"I think … that the boosting is gonna be an absolutely essential component of our response, not a bonus, not a luxury, but an absolute essential part of the program.\"**\n\n>**According to the virus expert, researchers did not \"have to time\" to do extensive studies to determine whether two doses would be better than three, as there was a pressing need to get vaccines out to people sooner rather than later, which was \"life-saving for millions of people,\" he noted.**\n\n>And as more time passes, we'll be able to see how long the boosters keep recipients protected from COVID—but Fauci is optimistic. **”We don't have the proof yet—the proof of the pudding will be after you get people vaccinated and boosted, and we have a greater durability of protection that doesn't wane as easily.”**\n\n_______________________________________________________\n\nSounds totally safe and not at all rushed or missing a ton of actual evidence on to me. Totally not making it up as they go along.\n\nIt also doesn’t seem like we’re aggressively pushing something that we’re lacking in any crucial data at all. \n\n100% SAFE AND EFFECTIVE GUYS… just, like, trust us, k? FULL SPEED AHEAD BOZOS!!\n\n…… /s (obviously)", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.7684}, {"title": "I ate dinner tonight, Mum. Even though I really didn’t want to.", "score": 39, "body": "I‘ve had eating disorders forever. I never had a healthy eating schedule growing up. We never ate as a family, we only had breakfast on Sundays, and my mum rarely ate dinner. That, on top of body image issues, a general dislike for food, sensory issues, and poor interoceptive awareness (I don’t feel hunger until I’m on the verge of passing out) …eating is a hard time. \n\nBut tonight I realised I hadn’t eaten, and instead of ignoring it like normal and going to bed anyway, I ordered some Chinese food. I didn’t eat it all, but I did eat.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.1477}, {"title": "When i was young Orwell and \"1984\" and \"Animal Farm\" were required reading, not required living.", "score": 184, "body": "And when we asked why we had to read them, we were told that it was so that things wouldn't turn out the way they have.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Second sweater!", "score": 261, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "What,if anything can the EU do about LGBTQ+ rights in Poland?", "score": 11, "body": "Poland is one of the worst places in the world to live as a member of the LGBTQ+ community. Multiple parts in Poland are labeled as LGBT free zones,where law enforcement can kick people out for being gay. Since Poland is apart of the EU is there anything that the EU can do about it?", "subreddit": "r/PoliticalDiscussion", "user_reports": [], "compound": 0.0}, {"title": "Did the vaccine rollout this summer change the way you think of humanity and the people around you?", "score": 267, "body": "I mean when they first \"rolled out\" where I live in Toronto Canada we had people literally rushing out to get them as soon as they could. These people didn't even think about it, they booked their appointments right away. One of my friends literally booked his vaccine in middle of a phone call and got it the next day. People were posting selfies being injected and one guy I was following posted his whole vaccine card on facebook (with his personal info).\n\nThe vaccine clinics were literally EVERYWHERE, and I mean shanty tents in sketchy parking lots, clinics at mall food courts, outside strip clubs, at McDonalds for crying out loud and people on NoNewNormal joked you got a happy meal with your shot. They called them \"pop-up clinics\" and they began to literally pop-up everywhere like massive gyms, at one point they packed stadiums downtown with hundreds and hundreds of chairs and were mass vaccinating every day with lines longer than an iPhone release. The city was administering thousands of doses every single day and putting the numbers out on the news.\n\nThey would film nurses injecting people at the sites and air the footage 24/7. It felt like humans were being portrayed as a herd of cattle and being dehumanized. The vaccine campaign slogans were literally \"we can do this\" and \"we're all in this together\" which made the whole damn thing feel like some ritual for a cult or a gang initiation. There were lotteries at work, free donuts and desserts, paid vacations, all day admissions at the Toronto Zoo, and Uber offered free rides to vaccine clinics.\n\nPeople walked around claiming teams over which \"vaccine\" they got injected with, we had team Pfizer and team Moderna etc. I remember coworkers getting their shots in the middle of the day and coming back into the office loudly telling everybody \"hey everyone I just got Pfizer\" or some bullshit like that (so many had side effects and had to take days off after).\n\nGod it was the creepiest summer of my life...I think we all need to pat ourselves on the back for getting out of it without \"rolling up our sleeves\".", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "It's Done! It's finally finished! 285hrs, 5,000m of yarn, 66,800 stitches. Weighing in at 5.5lbs. I can't wait to give it to my friend!", "score": 2539, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6219}, {"title": "Lord of the Flies disturbed me as much as it amazed me.", "score": 244, "body": "i had this book on my reading list for the longest time, so i finally caved in and bought the book around two weeks ago and i’ve finished it last night, and after having organised my thoughts, i decided i want to discuss it.\n\ni’ve read many other books in the past year, covid made me retake the habit lol, but not many books shook me to my core the way this book did.\n\n“lord of the flies” made me feel deeply, it made me uncomfortable sometimes, it disturbed me too, and at the same time it amazed me tremendously.\n\nGolding did a magnificent job at writing a deep and complex analysis of the brutal, violent and self-preservative nature of human beings, being capable of showing its brutality and highlighting it by making of his writing subjects young, impressionable and innocent school children.\n\nthe scenery description is also astounding, Golding writes such meticulous detail into the scenario we’ve been thrown in that you can’t help but feel as if you’re in the same dire situation as our young protagonists, thus, making the story much more impactful.", "subreddit": "r/books", "user_reports": [], "compound": 0.1531}, {"title": "Google's new censorship trick is to refuse to translate any foreign language antinarrative websites", "score": 350, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.34}, {"title": "Today I'm going to sit down and start making other dolls. Here are the best photos of Neptune and Uranus that I took yesterday afternoon.", "score": 208, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6369}, {"title": "I live in Italy unvaxxed, life is hard", "score": 996, "body": "Here you need a greenpass to go anywhere inside, or take a rapid train. \nFortunately I'm not working but if I did, I'd have to get tested every 2 days to have a greenpass.\nGoing out with friends is becoming difficult as it's getting cold and nobody wants to eat/drink outside. I started feeling bad as I have to ask friends to eat outside with me.\n\nI'm the only person who's not vaxxed among people I know and everyone is like \"Isn't it easier just to get vaxxed?\" F no I'll be the last one to get a jab, even if I have to lose all my friends. \nFu*k greenpass.\n\nIt seems like their goal is to eliminate the rebels and make a society full of submissive sheep.", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.1027}, {"title": "Progress on my first own colorwork design!", "score": 42, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.4753}, {"title": "Oklahoma National Guard goes rogue, rejects COVID vaccine mandate after sudden change of command", "score": 540, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.4939}, {"title": "The product you were sold vs. the product you got", "score": 795, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "They are saying the quiet part out loud again ——-Amazon’s Bezos predicts only limited number of people will get to remain on Earth", "score": 108, "body": "Humanity will move most industry into space and allow only a select few to remain on our planet, which will be turned into a natural resort, according to self-funded space explorer Jeff Bezos.\nThe Amazon billionaire enthusiastically shared his predictions for what human civilization will look like in the future – with him personally helping to bring that future closer – during a talk at the annual Ignatius Forum in Washington, DC.\n\nHe expects vast cylindrical space colonies spinning to create artificial gravity for millions of residents to take over most industrial production. Meanwhile, Earth will be turned into a natural reserve with restricted access similar to US national parks today.\n\n“This place is special, we can’t ruin it,” the founder of Amazon said of our planet.\n\n“Millions of people will move from Earth to space over time. And that’s the vision of Blue Origin – millions of people working in space,” he said, referring to his own firm.\n\n“Over centuries, most or many of the people will be born in space. It will be their first home. They will be born on these colonies, they will live on these colonies. They may visit Earth the way you would visit Yellowstone National Park,” Bezos predicted.\n\n\nhttps://www.rt.com/usa/540203-bezos-earth-population-limit/", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.1531}, {"title": "What are you doing this winter? (when unvaccinated)", "score": 105, "body": "I am unvaccinated, so because everything fun is gone, i am using this time to work on myself this winter. I am fully prepared to not miss anything and take these month one at a time. This is what i am doing this winter:  \n\n\n\\- started meditating using a Meditation-App  \n\\- started outdoor-sports using an fitnessapp  \n\\- learned a new language  \n\\- make some campfires outside with friends  \n\\- read a lot of books (philosophical and sci fi)\n\nWhat are you doing this winter?", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "What was a book or series that you were obsessed with in elementary school (ages: 5 - 10) or middle school (ages: 11 - 13)?", "score": 348, "body": "I hear a lot of times that a lot of readers were reading fanatics when they were younger. Although I wasn’t much of a reader in elementary school (i simply did not have the focus to finish a book), I was a reading fanatic in middle school. My favorite series at that time was The Lunar Chronicles by Marissa Meyers. My favorite book was definitely Fangirl by Rainbow Rowell. I still go back to those books to get that feeling of nostalgia.", "subreddit": "r/books", "user_reports": [], "compound": -0.1779}, {"title": "Good News! Data out of Israel says the booster shot offers \"at least\" 12 days of extra protection.", "score": 466, "body": "**Source:** https://www.nytimes.com/2021/09/15/health/covid-booster-shot-data.html\n\nSavor that almost two weeks of enhanced antibody goodness!", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.4926}, {"title": "Make a weird little stuffie!", "score": 36, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": -0.2481}, {"title": "1/2 way done with this blanket. 💕", "score": 49, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "YouTube Removes 138,000 Dislikes From Biden Videos In Middle Of Night", "score": 498, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.4019}, {"title": "Wilbur Smith: Popular Zambian-born author dies aged 88", "score": 251, "body": "", "subreddit": "r/books", "user_reports": [], "compound": 0.4215}, {"title": "🎄⛄🎄 Preparing for Christmas 🎄⛄🎄", "score": 67, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "The Rittenhouse shootings were a clearcut case of self-defense. However, because he was opposing the globalist funded rioters, the MSM wants the evidence to be ignored. The rule of law is a woke joke now.", "score": 74, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.0258}, {"title": "My local gas pump 😂", "score": 63, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Notice how this story flew under the radar", "score": 66, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "I was just banned from r/Australia", "score": 343, "body": "I was just permanently banned from r/Australia for saying “where there is risk there must be choice”.\n\nI cannot believe that this is where western society is now.", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.4588}, {"title": "Yule tree garland 🎄", "score": 179, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "“Look, I got vaccinated, and people took me to task for that. And I thought, ‘All right, I’ll get the damn vaccine.’ Here’s the deal, guys: I’ll get the vaccine, you f***ing leave me alone. And did that work? No. So, stupid me.” Jordan Peterson Regrets Getting The COVID vaccine. [Link to video]", "score": 110, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.9061}, {"title": "Mum I'm scared and need advice.", "score": 10, "body": "We were so careful but Still somehow my BF got covid. He's high risk and I heard him on the phone with Dr's this morning. We may need to go to the hospital soon. \n\nI'm trying so hard to be helpful but I don't know what to do. I make food he likes and make sure he's comfy but it seems useless. \n\nHe says he's fine but I can see him struggling to breathe and he's sleeping a lot. \n\nI just want to help. I want him to be OK. What do I do? I'm trying to not seem afraid but I think he thinks I don't care.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": -0.4404}, {"title": "Mom, I got engaged", "score": 108, "body": "Hi internet moms,\n\nI got engaged last night. Tried to reach out to my mom for the first time in may months, who told me to \"have a nice life\" and that she didn't want to be involved. I would love to feel some mom-type joy. Thanks <3", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.4019}, {"title": "My version of a sunflower tote🌻", "score": 52, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "As a young (mid 20s) woman navigating the world by myself... sometimes I wonder how much easier life would be if I had you for real, mom.", "score": 10, "body": "recently I had to fight for my damn life and crawl out of a depression hole. again. now I'm doing better, I'm borderline not depressed even. but sometimes I wonder, what would my life be like if I had a mom? do young women have close relationships with their moms? do moms play a big role in life? am I missing out? I don't know and thinking about it makes me sad.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.4215}, {"title": "Crocheting is NOT knitting", "score": 609, "body": "I'm so irritated that it is SO HARD to look up knitting patterns. When I find one I like it's crochet. They are very different! I don't know how to crochet! \n\nI like knitting stuffed animals but cute patters are so hard to find.", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "I made a sweater vest! I'm really happy with how it turned out", "score": 42, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6468}, {"title": "Oklahoma National Guard Won't Follow Vaccine Mandate.", "score": 254, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "[FO] love this beautiful pattern, hate the quarter stitches", "score": 236, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.729}, {"title": "[WIP] Epic Pokémon 95% Complete! Woohoo!!!", "score": 1461, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.6671}, {"title": "Mom, i don’t know if my fiancé is ok and i don’t know if i’m doing the right thing.", "score": 9, "body": "he went to a party and drank, which i was fine with. i don’t drink. i dropped him off and picked him up about 11:30 so that he was safe. when we got home i gave him water and his pumpkin pie blizzard from Dairy Queen. not long after that he threw up. I held his long hair and rubbed his back while telling him it was ok, none of his friends or family or my friends or family will ever know this happened, and i will\nnever laugh at or shame him for this. i put his hair up in a claw clip and he cleaned himself up while i cleaned the bathroom. we got in bed and all he wanted to do was cuddle me and watch trailer park boys. he kept saying I make him happy and he’s glad i’m there, as well as ask if i’m doing anything tomorrow, which i’m not. I offered to call or text his mom for him because i know that helps me. he’s been able to communicate clearly this whole time. it’s 3:30 am and he just told me he still feels drunk. i keep checking on him and making sure he’s breathing and ok. One time I threw up in front of him and he took care of me, cleaned my car that i threw up all over, hugged me even though i was covered in vomit. i’m not sure if he’s ok because i don’t drink. i know this makes him look bad, but i love him so much. he came into my life at my absolute lowest point and i would have commuted by now if it wasn’t for him. we plan to get married after we both finish college and beat the other one up if any cake-smashing-in-face occurs. He has grown so much as a person since I met him at 15, and I love him more than I love anything.\n\nEDIT: it’s about 4 am. He had trail mix, got some pizza and is laying in bed and eating it. He said he doesn’t feel drunk anymore, but lights hurt his eyes (could be a sleepy thing). i’m a little less worried.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.296}, {"title": "Dont use the word \"unvaccinated\".", "score": 41, "body": "Dont use the word \"unvaccinated\". It is Orwellian. It implies that \"vaccinated\" is the default. If I am debating any provax devil, I use the terms \"natural\" and \"corporate\", or \"artificial\" to refer to vaccination status. Only ever refer to a vaccine in terms of it being a man-made corporate product, because that is what it is. A lot of provax people are not actually aware of that. They don't think of it as a \"product\". They think of it as a \"cure\" or a \"solution\". Using terms like \"unvaccinated\" paints a subconscious picture in the mind of the one hearing it.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Finished this dress a few weeks ago and today I wore it for the very first time on my grandma's birthday. It took me a few weeks and lots of time but it was totally worth it🥰 my personal opinion: it looks in reallife way better than on the pic😅😊", "score": 1186, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.7677}, {"title": "Finally done! Plenty of mistakes and I’m never using Sultan Deluxe cotton again, but I don’t hate it.", "score": 990, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": -0.7959}, {"title": "You guys the push to vaccinate children is really getting to me.", "score": 711, "body": "In the US the numbers being reported are not accurate, doctors are being paid to list deaths as COVID, the vaccine is dangerous especially for children and can lead to lifelong heart conditions, now osha is trying to force everyone to be vaccinated otherwise they cannot work. I don’t think COVID is 100% a conspiracy, but the news is not reporting facts and governments are using it to gain more control and power over their people. I am a Christian and I believe everything that is going on is ultimately demonic and people are really blinded by darkness. But I feel like I’m outside a building that is on fire and I’m trying to scream at the people inside to get out of the building but they are just looking at me like I am a crazy person. I guess I need to feel ok that I and my family are safe and pray. It’s just painful to see it all happening.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "I've dediced not to donate any more blood until these vaccine mandates are lifted.", "score": 40, "body": "If you want me to help people, then I need you to stop making people choose between having a job or getting the vaccine. This is my way of protesting", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Athletes are collapsing on the field at 60x the normal rate in 2021. It's probably nothing...", "score": 870, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.296}, {"title": "Bill Gates says governments must PUNISH people for questioning mask and vaccine mandates online - vulms", "score": 170, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.6739}, {"title": "HOTH: The most fun blanket I’ve made", "score": 310, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.5563}, {"title": "“Look, I got vaccinated, and people took me to task for that. And I thought, ‘All right, I’ll get the damn vaccine.’ Here’s the deal, guys: I’ll get the vaccine, you f***ing leave me alone. And did that work? No. So, stupid me.” Jordan Peterson Regrets Getting The COVID vaccine.", "score": 564, "body": "[video ](https://np.reddit.com/r/AskThe_Donald/comments/qssrek/jordan_peterson_says_he_feels_stupid_for_drinking/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.9061}, {"title": "Some athletes who've died/ suffered serious heart issues recently", "score": 43, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.5423}, {"title": "Need opinions. Do these colors work together? Should I keep going?", "score": 444, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "Watch Novavax very closely over the next few months", "score": 361, "body": "Novavax utilizes a standardized vaccine approach, similar to the shingles and hepatitis vaccines that have been out for many years. It's a tried and true platform. Recently, the company received their first EUA in Indonesia and is applying in other countries. \n\nThey have asked for a meeting with the FDA to discuss the application here in the United States and hopes to submit by end of year. \n\nIf the FDA is serious in ending this pandemic, they will FASTLINE the vaccine. \n\nIf the FDA is deep in the pockets of Pfizer and Moderna, they will slow track the process or outright refuse the EUA and make them apply for standard approval stating \"there's already sufficient supply of vaccine\". Standard approval takes years.\n\nSo watch it closely and I think this will reveal what's really going on.\n\nhttps://uk.finance.yahoo.com/news/novavax-asks-for-fda-meeting-after-first-global-authorization-for-covid-19-vaccine-ceo-191036628.html", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "My first ever jumper!", "score": 42, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "A nice palate cleanser from the blanket I'm frantically, yet half-heartedly trying to finish for Christmas.", "score": 152, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.1027}, {"title": "I present to you: the one, the only, the terrifying(ly weirdly cute), the original chaos demon himself. GRITTY. (The Philly NHL team mascot)", "score": 27, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": -0.5574}, {"title": "Its been long dead when Hillary & Obama could ignore subpoenas and nothing happens", "score": 1597, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.7783}, {"title": "Anyone else feel like they have no incentive to comply? I have no reason to return to \"normal\"", "score": 290, "body": "Pre pandemic: dead end (but fulltime) job, few friends, no relationship, no kids, no way of affording a house.\n\nPost pandemic: Same, except I've moved into my parent's cabin and work part-time.\n\nSociety gave me absolutely zero fucking reason to comply to these bullshit mandates. My life before wasn't anything spectacular, and the idea I'd inject myself with this jab to go back to THAT is laughable.\n\nThe only thing I regret is the relationship/marriage and kids. In a better world,  that would be great. Now, I'd rather not. I know the depop agenda is a thing, but I have stopped caring. I'm a woman and the dating scene depresses me. Too bad but at the same time, that will be one less thing I have to worry about. Never understood that shit anyway. \n\nI laughed when Jordan Peterson thought he'd be \"left alone\" if he just got the vaccine. Anyone who struggles to fit in to society knows that it NEVER changes.\n\nEDIT: I also laughed my ass off when they offered donuts in exchange for getting the vaccine. Yeah, how about some REAL incentive - like offer full coverage of all health complications from the vaccine, or hell, why not just pay for all our medical costs since the government is now telling us what to inject into our own bodies. But a fucking donut?? It's a hilarious joke, only wish it wasn't being played on us", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.1531}, {"title": "Spike Protein Goes to Nucleus and Impairs DNA Repair (In-Vitro Study). Amazingly it is on YouTube, link in the submission statement.", "score": 34, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "This is some of the worst double-dose of Propaganda", "score": 864, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.7269}, {"title": "My crochet platform shoes are finished!", "score": 24, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "Pretty pleased with how cute my new scrap yarn hot water bottle cozy is💘", "score": 107, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.8442}, {"title": "started learning on halloween, now i made myself a hat", "score": 210, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "Fauci Sold the Entire Country to Big Pharma", "score": 35, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "I’m so excited that it’s nearly December!!! I’ve been working on my Holiday Doodle Cowl so that on December 1st I can immediately get into the festive spirit ❤️💚❤️💚", "score": 15, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.8741}, {"title": "[FO] I've finally framed this project after approximately 300 years. I know that this skelly boy is popular on the internet, but he will make a excellent addition to my dancing skeleton collection. Pattern from Kaplio on Etsy (link in the comments)", "score": 164, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.7876}, {"title": "Is it weird to donate books to the library?", "score": 94, "body": "Most of my friends have collections of books they’ve read, or have a small library in their homes. My family only ever buys books on holidays, so we get 90% of our books from the library. When I am done with a book thats been purchased, and I don’t think il read it again, Il usually donate it or drop it into the return slot at my library. Is that not a common thing? I feel like it’s kinda useless to keep a book if I won’t read it again, and I’d rather have it somewhere where someone else can also enjoy that book. Thoughts?", "subreddit": "r/books", "user_reports": [], "compound": -0.1779}, {"title": "Oklahoma National Guard Won’t Enforce Biden’s Vaccine Mandate — Defying Pentagon", "score": 171, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Each pair of shoes represents a child who will be withdrawn from school if the COVID vaccine is mandated (Corona/Norco Unified School District in California).", "score": 184, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.3818}, {"title": "Just a venting/looking for sympathy after the loss of my yarn stash.", "score": 27, "body": "So, I'll put the TLDR up here, I had to throw out almost all of my yarn stash because of an infestation.\n\nI had to move in with my parents a few years ago, they live in a pretty shitty apartment building but it's better than living on the street. Unfortunately we now have roaches and they of course decided that one of the best places to build a life would be in my boxes of yarn. 99% of my yarn was ruined and had to be thrown out, I'm devastated, a lot of it was from my great aunt who taught me to crochet and had sentimental value. I know I can buy more yarn eventually, but I'm not going to be in the position to do that for years due to my mental health issues. I'm on assistance right now and can't work so I don't have extra money to buy frivolous things like yarn.  \n\nCrochet was one of my self care activities, it helped with my CPTSD and anxiety, and now I barely have enough to make a small project. I just needed to vent to people who would understand how painful this is and allow me to mourn my stash without making fun of me or downplaying the importance because \"it's just yarn\".\n\nThanks for coming to my depressing TED talk, hope you are all doing much better than me and remember to pest proof your stash.", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0516}, {"title": "Not the best photo to show off this sweater I know but I’m so proud of it. Finished it over a month ago but only wearing it now. Thanks to everyone on here who gave me advice on seaming (I went with good old mattress stitch)!", "score": 526, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.9231}, {"title": "Finished sweater for my husband.", "score": 102, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "[FO] so pretty finished piece of Luca", "score": 63, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.5413}, {"title": "The Maxwell's got around", "score": 117, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "And so it begins... World’s first nationwide lockdown for the unvaxxed approved", "score": 30, "body": ">Austria will impose new curbs on the unvaccinated starting from Monday\n\n>The lockdown will come into effect at midnight and will apply to people aged 12 and older who have not been vaccinated and have not recently recovered from Covid-19. \n\nhttps://www.rt.com/news/540199-austria-lockdown-for-unvaxxed/", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.4215}, {"title": "I just love seeing your creations and progress here <3", "score": 746, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.91}, {"title": "Don’t use their mindslave language - call it as it is...", "score": 35, "body": "Booster = same shit that didn’t work the first two times\n\nVaccine = experimental, emergency-authorised gene-altering therapy drug\n\nVaccinated = obedient (wage) slaves and hypnotised blindfaithers\n\nAntivaxxers/ Unvaccinated = Questioning souls who know how to read (and wait)\n\nFollow the science = listen only to us and\n\nFake news - DO NOT READ\n\nAdverse reaction = vaccine injury\n\nWearing is caring = hypochondria, germophobia and social anxiety (you’re petrified about your own health and/or being attacked by others if you don’t wear one)\n\nEmergency authorisation - Why should we bother or need to care? (we’re going to accept Pharma at its word, ignore proven off label treatments and, since they‘re not financially liable and have no souls, we’ll let them use the global population for the continuation of our phase 3 trials.)\n\nAges 5-11 emergency authorisation = you think we care any more about your children than we do you? (We’re/ you’re so far gone we/ you no longer care about your children, and are happy to sacrifice them for our/ your own good/ perceived protection)\n\napproval = allowance of a period of time to elapse, having done nothing in the interim\n\n”You’re killing Grandma” - only we’re allowed to kill grandma (and grandpa, you sexists!)\n\ncovid-related death = “with” not ”of”\n\nNew Normal = hell on earth\n\nTrusted voices - voices we trust and you shouldn’t.\n\n”Two weeks to flatten the curve” - here, take this bit.\n\nLockdown = you are a potential criminal and therefore our prisoner\n\nMeasures to curb climate change/ COVID/ racism - more punishments for being bad (anxiety, guilt and shame dependent) with no benefit to anyone\n\nSuperspreaders = the group with billions (if not trillions) of spike proteins in their bloodstreams and are out there living their lives\n\nInformed consent = it’s all good, bro - we’d tell you if there were any causes for concern\n\nTop of my head. So very many more. Please contribute.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Video: Texas COVID Patient Denied Monoclonal Antibodies By Black Health Care Worker Because He’s White", "score": 36, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0772}, {"title": "2020: Only 2% of all hospitalization beds were occupied by COVID patients.", "score": 39, "body": "[https://www.atih.sante.fr/sites/default/files/public/content/4144/aah\\_2020\\_analyse\\_covid.pdf](https://www.atih.sante.fr/sites/default/files/public/content/4144/aah_2020_analyse_covid.pdf)\n\nIn France, during the whole year of 2020, only 2% of all hospitalization beds were occupied by COVID patients. And only 5% for the intensive care ones.\n\nThat's from an official report of the ATHI (Technical Agency for Information on Hospitalization).\n\nYou can easily believe that it must be the case (more or less) in every country in the world.\n\nWe are far from the idea the medias and politicians want us to have of hospitals full of Covid patients.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Melbourne, Australia: Health bill and vaccine passport protest (Nov. 12, 2021)", "score": 1050, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.25}, {"title": "[FO] I freakin’ love gnomes! Pattern by CuteBroidery on Etsy ❤️", "score": 34, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.6696}, {"title": "Bill Gates admits the Vaccine does not prevent infection. 27:55", "score": 51, "body": " [Bill Gates speaks to Rt Hon Jeremy Hunt MP in exclusive Policy Exchange interview - YouTube](https://www.youtube.com/watch?v=CZplF4qdwII)   \n\n\nwell there you have it. But Trust the medical expert who isn't one!", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.2792}, {"title": "Finished reading Life of Pi yesterday", "score": 40, "body": "I loved it. I've never felt/thought such thing while reading a book, but I loved every single sentence of it. By that I don't mean I loved the whole book as a whole piece (but obviously I did), I mean I loved every single sentence of it, one by one. Sometimes I read one sentence over and over again, and thought \"this is a very good sentence\". Perfect story, has a message, likeable characters, good wording, 10/10", "subreddit": "r/books", "user_reports": [], "compound": 0.0}, {"title": "I didn’t even get a chance to read the post. Should I have even expected anything else?", "score": 33, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.25}, {"title": "Just finished Pet Sematary for the first time", "score": 146, "body": "And what a roller coaster.\nI’ve seen the 80’s version a few times, so I new most of the big beats going in, but you know how things change when they get adapted (or are buried in tainted land).  I was fascinated by the descriptions of the pets not being quite right after they came back, and how Judd’s parents immediately knew what he had done. \n\nI’d have liked to get a historical story of someone else being brought back, as a lead in to the direct experience Judd shared.\n\nI know some people hate ambiguity, but I loved not knowing caused Victors spirit to be bound to Lewis and Ellie. Or how he had knowledge of the burial ground and how it would twist what it brought back. \n\nI also feel the book ending is better than either of the movies. The cliff hanger just hits better than seeing Rachel with the knife, or the zombie family.", "subreddit": "r/books", "user_reports": [], "compound": 0.0}, {"title": "Federal Judge Slaps Down Biden Vax Mandate, Taiwan Stops Child Pfizer Injections", "score": 205, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.1531}, {"title": "\"The data for Covid vaccine trials isn't available and won't be available for YEARS...Without Data It's Not Science\" -- Dr. Doshi", "score": 549, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "MKAL 2021 - My first MKAL", "score": 13, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}]