[{"title": "Newly Released Documents Show Exactly How Trump Admin. Undermined CDC During Pandemic", "score": 14846, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.3612}, {"title": "[FO] 33 tiny artworks and counting! My goal at the moment is 100!", "score": 645, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.0}, {"title": "I did my first craft fair today c: I wasn't busy at all (maybe 50 people in attendance), but I sold more than I could have ever hoped for!", "score": 1095, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6533}, {"title": "People of Melbourne have risen up", "score": 1873, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Took as long to make the blanket as it did to make the baby!", "score": 493, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Obituary — NPR books editor Petra Mayer has died", "score": 816, "body": "", "subreddit": "r/books", "user_reports": [], "compound": -0.5574}, {"title": "Mom, I had a really hard week. I’ve been sober for 11.5 months and I think I might relapse today.", "score": 720, "body": "It started with family drama on Sunday and Monday. I’m very private but shared some personal stuff about my open relationship and upcoming divorce with my mom. Who went and immediately told my dad, who didn’t know about my open relationship at all and called me upset and told me how disappointed he was. My mom apologized and I forgave her but I don’t feel supported by either of them, obviously.\n\nI saw friends later in the week and had a good time, but then it turned out we had forgotten my friend’s birthday and she was really upset. I tried to apologize and figure out how to make it better. I’m still trying but I’m having a hard time. I want to be a good friend but I don’t feel like I have much to give right now.\n\nMy boyfriend and I were supposed to have a fun day together on Friday since I took the day off. He suggested massages and then the movies. But he didn’t find any place that could do massages on Friday in time. I did, but he said they were too expensive and cancelled them. He tried to book another place but booked the wrong day so he cancelled those too. At the last minute he said we could re-book the expensive place but of course they couldn’t do it anymore. He also didn’t get any movie tickets like he said he would. I told him I really could have used a day of quality time and felt upset that he didn’t follow through on what he said he would do. He ignored me. I told him I didn’t feel supported by him and I really needed it. He ignored me again. This man is 40 years old and we have been dating for over 4 years. I don’t think I’ll ever get the support I need from him.\n\nSo I’m at my soon-to-be ex-husband’s apartment by myself with the cats I abandoned to live with my new boyfriend. I can’t think of anything to do to feel better except sleep or drink. And I already slept like 16 of the last 24 hours.\n\nI might just go to the store and get a bottle of booze. I don’t know what else to do.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": -0.1761}, {"title": "I actually want to struggle", "score": 339, "body": "I'll probably feel differently later but right now I'm fantasizing about living in a cheap shitty apartment, filling my fridge with the same 3 healthy meals, and working 50 hours a week while finishing my bachelors online.\n\nI was a pussy and a brat and a coward most of my life. At 23 I finally had the epiphany that my life is completely my responsibility and that I can't play victim anymore.\n\nTaking responsibility even if it means a lot more work makes me happier than I've ever been. It gives me a sense of control over my life and hope.", "subreddit": "r/selfimprovement", "user_reports": [], "compound": -0.25}, {"title": "Why do people care about federal laws on social issues like weed or abortion?", "score": 51, "body": "I understand that this isn't feasible for someone if they think that abortion is murder. It's kind of like \"why not let people own slaves in their own state\" that's why this question is mostly for people who perceive these issues as largely subjective and are concerned about the utilitarian aspect of the policies.\n\nIf states have the opportunity to run diverse sets of laws that the majority of people in those states want to live under then why not let them run their own experiment in order to find out more about the policy and its outcomes. Is the principle certainty that the policy will work better for every state or is it just a deontological belief about freedom or something else I'm missing?", "subreddit": "r/PoliticalDiscussion", "user_reports": [], "compound": 0.6908}, {"title": "Hundreds of shoes and handwritten notes at a California school representing the children who will be leaving if the vaccine mandate becomes a requirement to attend school", "score": 2527, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Well, when you put it that way...", "score": 233, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.2732}, {"title": "Ron Paul was right", "score": 1477, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Fauci Issues Urgent Warning to Vaccinated: “They are seeing a waning of immunity not only against infection but against hospitalization & to some extent death which is starting to now involve all age groups (not) just the elderly..ppl (are) getting breakthrough infections (&) winding up in hospital\"", "score": 2262, "body": "https://news.yahoo.com/dr-fauci-just-issued-urgent-201846228.html\n\n>On Nov. 12, White House COVID adviser Anthony Fauci, MD, went on The New York Times' podcast The Daily to discuss the current state of the coronavirus **in the U.S. According to Fauci, officials are now starting to see some waning immunity against both infection and hospitalization several months after initial vaccination.** The infectious disease expert pointed toward incoming data from Israel, which he noted tends to be about a month to a month and a half ahead of us in terms of the outbreak.\n\n>**”They are seeing a waning of immunity not only against infection but against hospitalization and to some extent death, which is starting to now involve all age groups. It isn't just the elderly,\" Fauci said. \"It's waning to the point that you're seeing more and more people getting breakthrough infections, and more and more of those people who are getting breakthrough infections are winding up in the hospital.”**\n\n>**Fauci went on to say, \"I think … that the boosting is gonna be an absolutely essential component of our response, not a bonus, not a luxury, but an absolute essential part of the program.\"**\n\n>**According to the virus expert, researchers did not \"have to time\" to do extensive studies to determine whether two doses would be better than three, as there was a pressing need to get vaccines out to people sooner rather than later, which was \"life-saving for millions of people,\" he noted.**\n\n>And as more time passes, we'll be able to see how long the boosters keep recipients protected from COVID—but Fauci is optimistic. **”We don't have the proof yet—the proof of the pudding will be after you get people vaccinated and boosted, and we have a greater durability of protection that doesn't wane as easily.”**\n\n_______________________________________________________\n\nSounds totally safe and not at all rushed or missing a ton of actual evidence on to me. Totally not making it up as they go along.\n\nIt also doesn’t seem like we’re aggressively pushing something that we’re lacking in any crucial data at all. \n\n100% SAFE AND EFFECTIVE GUYS… just, like, trust us, k? FULL SPEED AHEAD BOZOS!!\n\n…… /s (obviously)", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.7684}, {"title": "It’s my birthday weekend. My fiancé took me to the local amusement park and it all just went terribly. I decided to get a caricature for the first time and I feel so gross.", "score": 216, "body": "", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": -0.7262}, {"title": "Finished up another sweater!", "score": 1443, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Anna Karenina. Damn.", "score": 1710, "body": "Just finished part one, and don’t wish to have it spoiled but just need a place to let out what I feel so far. This is truly the greatest novel I have ever read and I’m glad I waited till now that I’m in my later 40s. I feel as though I can appreciate it more. I’m amazed at how Tolstoy is able to describe the slight loss of love that happens after a new infatuation.  When Anna returns from Moscow and describes how her husbands ears seem weird and even describes her own child slightly less glowing as before she went to Moscow.  As someone whom has lived life and experienced similar things, I read that and realize the human condition is and has been the same throughout history. This is truly the best thing I’ve read in my life so far !", "subreddit": "r/books", "user_reports": [], "compound": -0.4019}, {"title": "You need to take responsibility for your life.", "score": 232, "body": "One of the biggest differences between me now and me 3 years ago is simple: I’ve taken responsibility for my life.\n\n\nNow what I mean when I say taking responsibility, is accepting and taking ownership of my life. \n\n\nI am responsible for my life, and everything that affects me is my responsibility to deal with.\n\n\nAnd you need to be responsible for yours. You need to be responsible for your health by exercising regularly and eating well, you need to be responsible for your social life and ensuring you are social and maintaining friendships, you need to be responsible for everything that affects you. And I'm going to tell you how to get there.\n\n\nI see a lot of young men in particular, who are angry at the world, they think that life isn’t treating them the same way it treats others.\n\n\n And guess what…It isn’t.\n\n\n Some people have far greater advantages than others, and some people are hit with terrible misfortune and suffering. And whichever end of the spectrum you are, you are responsible for your life. \n\n\nResponsibility isn’t the same as fault: It’s not your fault that your parents are rich, it’s not your fault your dad died. But you are responsible for how these things affect your life, you choose how you deal with them.\n\n\nSome people have lost family and consequently turned to drugs and alcohol, others have lost family and started charities or companies. \n\n\nThere are ways to deal with every situation, some better, some worse.\n\n\nYour circumstances don’t define you, your response to them does.\n\n\nI hear all the time on self-improvement forums “I can’t do that because…”  I don’t care about the because, take some fucking responsibility and find a workaround. \n\n\nThe first step to gaining some responsibility for your life is realising that you are someone worth helping. You deserve someone to look after you and make sure you can be the best version of yourself possible. Make that person you. Recognise that responsibility isn’t a negative thing, It’s a privilege. \n\n\nYou GET to be responsible for your own life. \n\n\nIt’s incredible freeing to know that, while life may fuck you, ultimately you are responsible for your misery. You are also responsible for all of your achievements, successes and happiness. \n\n\nSo fucking own it.\n\n\n\nThe second step is starting to act like you are responsible for your life.\n\n\nThere is no third step.\n\n\nIs your job shit? It’s your responsibility to either try and make it less shit, or quit.\n\n\nDo you feel like shit? That’s your responsibility to figure out why and make changes\n\n\nAre your relationships shit? Take some responsibility for it, cut people off if you need to, try harder, just know that It’s your responsibility to improve them.\n\n\nIs your body shit? That’s your responsibility too bozo, go for a run or something idk.\n\n\nNot sticking to your goals? Actually NOT your responsibility - I’m joking, of course it is you muppet.\n\n\n\n\nYou don’t have to be perfect, you just have to try. Take responsibility, do the work.\n\n\n\nJoe ", "subreddit": "r/selfimprovement", "user_reports": [], "compound": 0.0}, {"title": "Ex-press secretary Stephanie Grisham says ‘paranoid’ Trump had ‘off the books’ meetings to keep details out of archives", "score": 754, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.0}, {"title": "I live in Italy unvaxxed, life is hard", "score": 943, "body": "Here you need a greenpass to go anywhere inside, or take a rapid train. \nFortunately I'm not working but if I did, I'd have to get tested every 2 days to have a greenpass.\nGoing out with friends is becoming difficult as it's getting cold and nobody wants to eat/drink outside. I started feeling bad as I have to ask friends to eat outside with me.\n\nI'm the only person who's not vaxxed among people I know and everyone is like \"Isn't it easier just to get vaxxed?\" F no I'll be the last one to get a jab, even if I have to lose all my friends. \nFu*k greenpass.\n\nIt seems like their goal is to eliminate the rebels and make a society full of submissive sheep.", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.1027}, {"title": "Did the vaccine rollout this summer change the way you think of humanity and the people around you?", "score": 209, "body": "I mean when they first \"rolled out\" where I live in Toronto Canada we had people literally rushing out to get them as soon as they could. These people didn't even think about it, they booked their appointments right away. One of my friends literally booked his vaccine in middle of a phone call and got it the next day. People were posting selfies being injected and one guy I was following posted his whole vaccine card on facebook (with his personal info).\n\nThe vaccine clinics were literally EVERYWHERE, and I mean shanty tents in sketchy parking lots, clinics at mall food courts, outside strip clubs, at McDonalds for crying out loud and people on NoNewNormal joked you got a happy meal with your shot. They called them \"pop-up clinics\" and they began to literally pop-up everywhere like massive gyms, at one point they packed stadiums downtown with hundreds and hundreds of chairs and were mass vaccinating every day with lines longer than an iPhone release. The city was administering thousands of doses every single day and putting the numbers out on the news.\n\nThey would film nurses injecting people at the sites and air the footage 24/7. It felt like humans were being portrayed as a herd of cattle and being dehumanized. The vaccine campaign slogans were literally \"we can do this\" and \"we're all in this together\" which made the whole damn thing feel like some ritual for a cult or a gang initiation. There were lotteries at work, free donuts and desserts, paid vacations, all day admissions at the Toronto Zoo, and Uber offered free rides to vaccine clinics.\n\nPeople walked around claiming teams over which \"vaccine\" they got injected with, we had team Pfizer and team Moderna etc. I remember coworkers getting their shots in the middle of the day and coming back into the office loudly telling everybody \"hey everyone I just got Pfizer\" or some bullshit like that (so many had side effects and had to take days off after).\n\nGod it was the creepiest summer of my life...I think we all need to pat ourselves on the back for getting out of it without \"rolling up our sleeves\".", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Second sweater!", "score": 230, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Oklahoma National Guard goes rogue, rejects COVID vaccine mandate after sudden change of command", "score": 509, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.4939}, {"title": "Google's new censorship trick is to refuse to translate any foreign language antinarrative websites", "score": 287, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.34}, {"title": "The product you were sold vs. the product you got", "score": 744, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "When i was young Orwell and \"1984\" and \"Animal Farm\" were required reading, not required living.", "score": 95, "body": "And when we asked why we had to read them, we were told that it was so that things wouldn't turn out the way they have.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Picture explains itself.", "score": 69, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Good News! Data out of Israel says the booster shot offers \"at least\" 12 days of extra protection.", "score": 428, "body": "**Source:** https://www.nytimes.com/2021/09/15/health/covid-booster-shot-data.html\n\nSavor that almost two weeks of enhanced antibody goodness!", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.4926}, {"title": "It's Done! It's finally finished! 285hrs, 5,000m of yarn, 66,800 stitches. Weighing in at 5.5lbs. I can't wait to give it to my friend!", "score": 2493, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6219}, {"title": "What are you doing this winter? (when unvaccinated)", "score": 84, "body": "I am unvaccinated, so because everything fun is gone, i am using this time to work on myself this winter. I am fully prepared to not miss anything and take these month one at a time. This is what i am doing this winter:  \n\n\n\\- started meditating using a Meditation-App  \n\\- started outdoor-sports using an fitnessapp  \n\\- learned a new language  \n\\- make some campfires outside with friends  \n\\- read a lot of books (philosophical and sci fi)\n\nWhat are you doing this winter?", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Americans Need to Learn to Live More Like Europeans", "score": 4507, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.4201}, {"title": "YouTube Removes 138,000 Dislikes From Biden Videos In Middle Of Night", "score": 466, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.4019}, {"title": "Lord of the Flies disturbed me as much as it amazed me.", "score": 216, "body": "i had this book on my reading list for the longest time, so i finally caved in and bought the book around two weeks ago and i’ve finished it last night, and after having organised my thoughts, i decided i want to discuss it.\n\ni’ve read many other books in the past year, covid made me retake the habit lol, but not many books shook me to my core the way this book did.\n\n“lord of the flies” made me feel deeply, it made me uncomfortable sometimes, it disturbed me too, and at the same time it amazed me tremendously.\n\nGolding did a magnificent job at writing a deep and complex analysis of the brutal, violent and self-preservative nature of human beings, being capable of showing its brutality and highlighting it by making of his writing subjects young, impressionable and innocent school children.\n\nthe scenery description is also astounding, Golding writes such meticulous detail into the scenario we’ve been thrown in that you can’t help but feel as if you’re in the same dire situation as our young protagonists, thus, making the story much more impactful.", "subreddit": "r/books", "user_reports": [], "compound": 0.1531}, {"title": "What,if anything can the EU do about LGBTQ+ rights in Poland?", "score": 6, "body": "Poland is one of the worst places in the world to live as a member of the LGBTQ+ community. Multiple parts in Poland are labeled as LGBT free zones,where law enforcement can kick people out for being gay. Since Poland is apart of the EU is there anything that the EU can do about it?", "subreddit": "r/PoliticalDiscussion", "user_reports": [], "compound": 0.0}, {"title": "IM (23F) A LONE WOLF LOSER!!", "score": 31, "body": "Hey all. I'm a loser with no self esteem and this affects every facet of my life. Like literally. No self esteem. I can't name one thing I like about myself. Nope, really, not one. I have instances where I like myself, but nothing in general. For example, there are times I exhibit patience, or kindness, or drive. But not consistently enough where it is anywhere near a characteristic part of myself that I could then \"like\" about myself. \n\n&#x200B;\n\nI have no relationship with my dad because he is awful, and a so-so relationship with my mom who lives in another country. Right now I live with my aunt and uncle and their two kids. I am in college, with one more semester getting a degree in management that I absolutely hate (was pressured into getting a business degree, I really regret it). After next semester, if I work really hard, I will graduate with a 2.5GPA. I'm not kidding. I suck. I thought hey maybe I can get a masters degree in something that I actually like. Nope, the majority require a minimum of 3.0GPA, which I wont have, and letters or recommendation which I wouldn't get because, yknow, terrible student. \n\n&#x200B;\n\nI work a part time house keeping job three days a week and make $13 an hour. The thought of having a full time job in ANYTHING makes me want to die, because I will hate whatever job it is, because I have no passion for anything. I will be graduating with about 25k in debt which Im terrified to start tackling.\n\nI have one friend. Nope not an exaggeration, just one, and I love her to death and she loves me. But she lives an hour away, and has a job, and a husband, and a life. We don't see each other much.\n\n&#x200B;\n\nWhen I wake up, the first thing I do is run out the door to smoke cigs, and buy soda. I smoke so many cigs and drink so much soda. The only thing I eat is in-n-out. Like that must be an eating disorder. I'm not kidding. It is the only thing I can think of stomaching. The only reason I am not fat is because I limit myself to just one in-n-out meal a day so that I don'g get fat. And also because I don't have a lot of money. I don't exercise and my sleeping is erratic. I just feel like shit mentally and physically.\n\n&#x200B;\n\nThe only thing I have \"going\" for me is that I am pretty attractive. Like an 8/10. Maybe even a 9/10. But that doesn't even matter, well period, but it also doesn't matter because I don't really take care of myself because it doesn't seem like there is a point. No one sees me anyway beside the family I live with and the people at work, but I wear a mask at work. I don't ever see my one friend, school is online, and I have no love life. Also, pandemic. So no point in looking good.\n\n&#x200B;\n\nI used to have a love life, but we broke up in April. We have been on and off for 7 years. Each time more toxic than the next. Like seriously, I went through some shit. Yet my thoughts are obsessive and revolve around him. I don't even know why I want him back because it was miserable, but he is all I think about. I don't blame him for not wanting me back. I mean hello, I am a fucking. Loser. If some new guy tried to date me, and he was all that I am currently describing about me I would be like fuck no. (All my problems I had before the breakup so this is not about the break up)\n\nI am so stuck. I dont even know why I am writing this, but I fucking hate myself.", "subreddit": "r/selfimprovement", "user_reports": [], "compound": -0.7256}, {"title": "Trump Encouraged Staff To Break The Law, Says Former Press Secretary", "score": 1862, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.3612}, {"title": "I ate dinner tonight, Mum. Even though I really didn’t want to.", "score": 26, "body": "I‘ve had eating disorders forever. I never had a healthy eating schedule growing up. We never ate as a family, we only had breakfast on Sundays, and my mum rarely ate dinner. That, on top of body image issues, a general dislike for food, sensory issues, and poor interoceptive awareness (I don’t feel hunger until I’m on the verge of passing out) …eating is a hard time. \n\nBut tonight I realised I hadn’t eaten, and instead of ignoring it like normal and going to bed anyway, I ordered some Chinese food. I didn’t eat it all, but I did eat.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.1477}, {"title": "I was just banned from r/Australia", "score": 319, "body": "I was just permanently banned from r/Australia for saying “where there is risk there must be choice”.\n\nI cannot believe that this is where western society is now.", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.4588}, {"title": "Today I'm going to sit down and start making other dolls. Here are the best photos of Neptune and Uranus that I took yesterday afternoon.", "score": 189, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6369}, {"title": "What was a book or series that you were obsessed with in elementary school (ages: 5 - 10) or middle school (ages: 11 - 13)?", "score": 334, "body": "I hear a lot of times that a lot of readers were reading fanatics when they were younger. Although I wasn’t much of a reader in elementary school (i simply did not have the focus to finish a book), I was a reading fanatic in middle school. My favorite series at that time was The Lunar Chronicles by Marissa Meyers. My favorite book was definitely Fangirl by Rainbow Rowell. I still go back to those books to get that feeling of nostalgia.", "subreddit": "r/books", "user_reports": [], "compound": -0.1779}, {"title": "Pete Buttigieg Says Paid Family Leave Isn't Just Time Off: 'It's Time to Do Important Work'", "score": 21315, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.1531}, {"title": "Is it possible to learn to feel emotions at 24?", "score": 12, "body": "I feel like a soulless rock a lot. I'm not sure i'm a lost case yet because Ive seen people my age and younger who are a lot more repressed and far worse overall. I think I do have some expression range in my way of talking. I dont even know which emotions I struggle with. I can't cry for real ever. I mean, only once in a while (once a month or sometimes every 2 months) I would get my eyes teary, but not much more.", "subreddit": "r/selfimprovement", "user_reports": [], "compound": 0.0}, {"title": "The Trump White House silenced health experts trying to warn the public about COVID-19, new testimony says", "score": 11942, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.1027}, {"title": "Mom, I’m gay. Is that okay?", "score": 716, "body": "I just want you to love me. I just want to be accepted. I want to not feel like I’m an embarrassment to the family. I want to bring home a boyfriend and have you be proud of me.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.2263}, {"title": "They are saying the quiet part out loud again ——-Amazon’s Bezos predicts only limited number of people will get to remain on Earth", "score": 64, "body": "Humanity will move most industry into space and allow only a select few to remain on our planet, which will be turned into a natural resort, according to self-funded space explorer Jeff Bezos.\nThe Amazon billionaire enthusiastically shared his predictions for what human civilization will look like in the future – with him personally helping to bring that future closer – during a talk at the annual Ignatius Forum in Washington, DC.\n\nHe expects vast cylindrical space colonies spinning to create artificial gravity for millions of residents to take over most industrial production. Meanwhile, Earth will be turned into a natural reserve with restricted access similar to US national parks today.\n\n“This place is special, we can’t ruin it,” the founder of Amazon said of our planet.\n\n“Millions of people will move from Earth to space over time. And that’s the vision of Blue Origin – millions of people working in space,” he said, referring to his own firm.\n\n“Over centuries, most or many of the people will be born in space. It will be their first home. They will be born on these colonies, they will live on these colonies. They may visit Earth the way you would visit Yellowstone National Park,” Bezos predicted.\n\n\nhttps://www.rt.com/usa/540203-bezos-earth-population-limit/", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.1531}, {"title": "Press Secretary Jen Psaki returns to work after Covid-19 - \"I remain incredibly grateful for the vaccine for keeping me safe and other people in my house safe as well,\" she said.", "score": 808, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.8439}, {"title": "Former Trump national security adviser Michael Flynn calls for one religion in America", "score": 977, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.34}, {"title": "Wilbur Smith: Popular Zambian-born author dies aged 88", "score": 231, "body": "", "subreddit": "r/books", "user_reports": [], "compound": 0.4215}, {"title": "Oklahoma National Guard Won't Follow Vaccine Mandate.", "score": 224, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Things are going to be okay.", "score": 37, "body": "This year, 2021 has been a fantastic year for me. I went back to school and restarted my bachelors after a small hiatus. I found what I wanted to do in life. I started training and lost 40 pounds. I've packed away a lot of money after working through the whole pandemic. And I've finally got the chance to buy a car I've always wanted.\n\n&#x200B;\n\nThis year has been great, to many more!", "subreddit": "r/selfimprovement", "user_reports": [], "compound": 0.2263}, {"title": "“Look, I got vaccinated, and people took me to task for that. And I thought, ‘All right, I’ll get the damn vaccine.’ Here’s the deal, guys: I’ll get the vaccine, you f***ing leave me alone. And did that work? No. So, stupid me.” Jordan Peterson Regrets Getting The COVID vaccine. [Link to video]", "score": 83, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.9061}, {"title": "GOP silence deafening as post-Jan. 6 threats of violence escalate", "score": 5184, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.8442}, {"title": "You guys the push to vaccinate children is really getting to me.", "score": 690, "body": "In the US the numbers being reported are not accurate, doctors are being paid to list deaths as COVID, the vaccine is dangerous especially for children and can lead to lifelong heart conditions, now osha is trying to force everyone to be vaccinated otherwise they cannot work. I don’t think COVID is 100% a conspiracy, but the news is not reporting facts and governments are using it to gain more control and power over their people. I am a Christian and I believe everything that is going on is ultimately demonic and people are really blinded by darkness. But I feel like I’m outside a building that is on fire and I’m trying to scream at the people inside to get out of the building but they are just looking at me like I am a crazy person. I guess I need to feel ok that I and my family are safe and pray. It’s just painful to see it all happening.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Athletes are collapsing on the field at 60x the normal rate in 2021. It's probably nothing...", "score": 859, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.296}, {"title": "Yule tree garland 🎄", "score": 172, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "\"You need a little education\": GOP lawmaker confronts Tucker Carlson on U.S.-Ukraine ties", "score": 3294, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.2263}, {"title": "“Look, I got vaccinated, and people took me to task for that. And I thought, ‘All right, I’ll get the damn vaccine.’ Here’s the deal, guys: I’ll get the vaccine, you f***ing leave me alone. And did that work? No. So, stupid me.” Jordan Peterson Regrets Getting The COVID vaccine.", "score": 556, "body": "[video ](https://np.reddit.com/r/AskThe_Donald/comments/qssrek/jordan_peterson_says_he_feels_stupid_for_drinking/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.9061}, {"title": "Pentagon says it will respond to Oklahoma's governor after state's National Guard rejects its vaccine mandate", "score": 2067, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.4939}, {"title": "🎄⛄🎄 Preparing for Christmas 🎄⛄🎄", "score": 54, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "Watch Novavax very closely over the next few months", "score": 354, "body": "Novavax utilizes a standardized vaccine approach, similar to the shingles and hepatitis vaccines that have been out for many years. It's a tried and true platform. Recently, the company received their first EUA in Indonesia and is applying in other countries. \n\nThey have asked for a meeting with the FDA to discuss the application here in the United States and hopes to submit by end of year. \n\nIf the FDA is serious in ending this pandemic, they will FASTLINE the vaccine. \n\nIf the FDA is deep in the pockets of Pfizer and Moderna, they will slow track the process or outright refuse the EUA and make them apply for standard approval stating \"there's already sufficient supply of vaccine\". Standard approval takes years.\n\nSo watch it closely and I think this will reveal what's really going on.\n\nhttps://uk.finance.yahoo.com/news/novavax-asks-for-fda-meeting-after-first-global-authorization-for-covid-19-vaccine-ceo-191036628.html", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Crocheting is NOT knitting", "score": 590, "body": "I'm so irritated that it is SO HARD to look up knitting patterns. When I find one I like it's crochet. They are very different! I don't know how to crochet! \n\nI like knitting stuffed animals but cute patters are so hard to find.", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Its been long dead when Hillary & Obama could ignore subpoenas and nothing happens", "score": 1580, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.7783}, {"title": "Bill Gates says governments must PUNISH people for questioning mask and vaccine mandates online - vulms", "score": 143, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.6739}, {"title": "Notice how this story flew under the radar", "score": 38, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Make a weird little stuffie!", "score": 27, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": -0.2481}, {"title": "This is some of the worst double-dose of Propaganda", "score": 851, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.7269}, {"title": "Anyone else feel like they have no incentive to comply? I have no reason to return to \"normal\"", "score": 287, "body": "Pre pandemic: dead end (but fulltime) job, few friends, no relationship, no kids, no way of affording a house.\n\nPost pandemic: Same, except I've moved into my parent's cabin and work part-time.\n\nSociety gave me absolutely zero fucking reason to comply to these bullshit mandates. My life before wasn't anything spectacular, and the idea I'd inject myself with this jab to go back to THAT is laughable.\n\nThe only thing I regret is the relationship/marriage and kids. In a better world,  that would be great. Now, I'd rather not. I know the depop agenda is a thing, but I have stopped caring. I'm a woman and the dating scene depresses me. Too bad but at the same time, that will be one less thing I have to worry about. Never understood that shit anyway. \n\nI laughed when Jordan Peterson thought he'd be \"left alone\" if he just got the vaccine. Anyone who struggles to fit in to society knows that it NEVER changes.\n\nEDIT: I also laughed my ass off when they offered donuts in exchange for getting the vaccine. Yeah, how about some REAL incentive - like offer full coverage of all health complications from the vaccine, or hell, why not just pay for all our medical costs since the government is now telling us what to inject into our own bodies. But a fucking donut?? It's a hilarious joke, only wish it wasn't being played on us", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.1531}, {"title": "My local gas pump 😂", "score": 33, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "[FO] love this beautiful pattern, hate the quarter stitches", "score": 214, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.729}, {"title": "Meanwhile, Steve Bannon Is Reminding Everyone That the Right Is Very Much Trying to Destroy Democracy", "score": 18939, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.5423}, {"title": "[WIP] Epic Pokémon 95% Complete! Woohoo!!!", "score": 1457, "body": "", "subreddit": "r/CrossStitch", "user_reports": [], "compound": 0.6671}, {"title": "As a young (mid 20s) woman navigating the world by myself... sometimes I wonder how much easier life would be if I had you for real, mom.", "score": 10, "body": "recently I had to fight for my damn life and crawl out of a depression hole. again. now I'm doing better, I'm borderline not depressed even. but sometimes I wonder, what would my life be like if I had a mom? do young women have close relationships with their moms? do moms play a big role in life? am I missing out? I don't know and thinking about it makes me sad.", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.4215}, {"title": "Mom, I got engaged", "score": 108, "body": "Hi internet moms,\n\nI got engaged last night. Tried to reach out to my mom for the first time in may months, who told me to \"have a nice life\" and that she didn't want to be involved. I would love to feel some mom-type joy. Thanks <3", "subreddit": "r/MomForAMinute", "user_reports": [], "compound": 0.4019}, {"title": "Michael Flynn faces backlash after saying America should only have one religion", "score": 172, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.0}, {"title": "The Rittenhouse shootings were a clearcut case of self-defense. However, because he was opposing the globalist funded rioters, the MSM wants the evidence to be ignored. The rule of law is a woke joke now.", "score": 36, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.0258}, {"title": "Finished this dress a few weeks ago and today I wore it for the very first time on my grandma's birthday. It took me a few weeks and lots of time but it was totally worth it🥰 my personal opinion: it looks in reallife way better than on the pic😅😊", "score": 1177, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.7677}, {"title": "My version of a sunflower tote🌻", "score": 40, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "I made a sweater vest! I'm really happy with how it turned out", "score": 35, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.6468}, {"title": "Each pair of shoes represents a child who will be withdrawn from school if the COVID vaccine is mandated (Corona/Norco Unified School District in California).", "score": 179, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.3818}, {"title": "Finally done! Plenty of mistakes and I’m never using Sultan Deluxe cotton again, but I don’t hate it.", "score": 981, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": -0.7959}, {"title": "Oklahoma National Guard Won’t Enforce Biden’s Vaccine Mandate — Defying Pentagon", "score": 161, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "The Real Source of Inflation? Consolidated Corporate Power and Greed", "score": 1328, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.4019}, {"title": "HOTH: The most fun blanket I’ve made", "score": 304, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.5563}, {"title": "I've dediced not to donate any more blood until these vaccine mandates are lifted.", "score": 26, "body": "If you want me to help people, then I need you to stop making people choose between having a job or getting the vaccine. This is my way of protesting", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "‘Terrifying for American democracy’: is Trump planning for a 2024 coup?", "score": 214, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.0}, {"title": "Need opinions. Do these colors work together? Should I keep going?", "score": 419, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "Melbourne, Australia: Health bill and vaccine passport protest (Nov. 12, 2021)", "score": 1042, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.25}, {"title": "A nice palate cleanser from the blanket I'm frantically, yet half-heartedly trying to finish for Christmas.", "score": 141, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.1027}, {"title": "I have improved so much recently. I posted about it all a little earlier this month and even though im proud of it i...im broken. I saw that my ex is dating again and it made me want to stop progressing. Made me realise that maybe my progress has been to get her to love me.", "score": 10, "body": "My ex is an alchoholic and cheated on me multiple times with multiple men, one of whom was her ex. At the time i found out she had cheated on me, she told me it was because she was blackout and these men took advantage of her. Of course i couldnt blame her, what a terrible thing. \n\n\nHowever, as time has passed(she broke up with me a few months ago but we have stayed friends) i have found more and more evidence that she meant to cheat and that her encounters were more consensual then she had said, especially the times with her ex. She has told me some things while being drunk or made offhand comments about stuff that have totally flipped the script. Not to mention a pretty shitty conversation i had with her ex once. \n\n\n\nThing is, i had already forgiven her for them and had moved on emotionally. I didnt hold any grudges or anything. She even supposedly broke up with me so i could truly work on myself. Which hurt but i thought was a selfless thing to do. I have worked on myself. Im in such a different place and am doi ng greath things...\n\n\nBut it turns out that a lot of my motivation for change was so she would take me back because the second i found out she was dating other guys i lost all desire to be different and now.....now all of those little things here and there ive found about her cheating are slowly eating me up inside to the point where i cut her off as a friend for a while. \n\n\n\nHow do i...um...how do i love myself when she said she loved me and then still did what she did?", "subreddit": "r/selfimprovement", "user_reports": [], "compound": 0.8481}, {"title": "My first ever jumper!", "score": 37, "body": "", "subreddit": "r/knitting", "user_reports": [], "compound": 0.0}, {"title": "Trump called Chris Christie when they were both hospitalized with COVID-19 to make sure he wouldn't be blamed for the infection, book says", "score": 157, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.5932}, {"title": "How can some people can only be busy with themselves?", "score": 3, "body": "My wife and I have a friend (f 30) who has a relationship and underaged kids. She sometimes still goes to parties and leaves the guy at home with the kids. She manages to send me a text at 3 am to ask if I can pick her up and drive her home (lives across our house). I didn’t respond since we were sleeping so she got home with a couple of her male friends who drove her. Then in the morning she cannot stop telling how drunk she still is and if I can see on our surveillance cam how late she got home. Then she tells me that Fred called Rick and Johnny (fake names) to bring her home by car. \n\nI cannot understand that her boyfriend is okay with this (point 1) and I cannot stop thinking why she would tell me all of this, knowing that her being drunk makes “the brakes go a bit looser” with her (point 2).\n\nNow, for me to get better: How in the world can I stop carring for them (point 1) and how can I stop thinking about why she’s telling me all these things??  (And why is she though?) (Point 2). Moving or not seeing eachother is not an options since they live practically in front of us. We try to not make more contact then necessary. She can have a hangover, not give a damn and lay all day on the couch resting and probably not thinking about these things or what so ever but I can think about these things all day long and I don’t want to!!", "subreddit": "r/selfimprovement", "user_reports": [], "compound": 0.0}, {"title": "The Maxwell's got around", "score": 100, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "\"The data for Covid vaccine trials isn't available and won't be available for YEARS...Without Data It's Not Science\" -- Dr. Doshi", "score": 539, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "2020: Only 2% of all hospitalization beds were occupied by COVID patients.", "score": 35, "body": "[https://www.atih.sante.fr/sites/default/files/public/content/4144/aah\\_2020\\_analyse\\_covid.pdf](https://www.atih.sante.fr/sites/default/files/public/content/4144/aah_2020_analyse_covid.pdf)\n\nIn France, during the whole year of 2020, only 2% of all hospitalization beds were occupied by COVID patients. And only 5% for the intensive care ones.\n\nThat's from an official report of the ATHI (Technical Agency for Information on Hospitalization).\n\nYou can easily believe that it must be the case (more or less) in every country in the world.\n\nWe are far from the idea the medias and politicians want us to have of hospitals full of Covid patients.", "subreddit": "r/conspiracy", "user_reports": [], "compound": 0.0}, {"title": "Federal Judge Slaps Down Biden Vax Mandate, Taiwan Stops Child Pfizer Injections", "score": 195, "body": "", "subreddit": "r/conspiracy", "user_reports": [], "compound": -0.1531}, {"title": "Liz Cheney accuses Ted Cruz of appealing to ‘secessionist’ vote", "score": 182, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": -0.34}, {"title": "started learning on halloween, now i made myself a hat", "score": 197, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.0}, {"title": "U.S. Government Funds First Therapeutic Psilocybin Research in 50 Years", "score": 3702, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.0}, {"title": "Pretty pleased with how cute my new scrap yarn hot water bottle cozy is💘", "score": 102, "body": "", "subreddit": "r/crochet", "user_reports": [], "compound": 0.8442}, {"title": "Kinzinger says he hopes Bannon indictment sends 'chilling message'", "score": 1856, "body": "", "subreddit": "r/politics", "user_reports": [], "compound": 0.4019}]