[{"title": "Pete Buttigieg Says Paid Family Leave Isn't Just Time Off: 'It's Time to Do Important Work'", "body": ""}, {"title": "Fauci Issues Urgent Warning to Vaccinated: “They are seeing a waning of immunity not only against infection but against hospitalization & to some extent death which is starting to now involve all age groups (not) just the elderly..ppl (are) getting breakthrough infections (&) winding up in hospital\"", "body": "https://news.yahoo.com/dr-fauci-just-issued-urgent-201846228.html\n\n>On Nov. 12, White House COVID adviser Anthony Fauci, MD, went on The New York Times' podcast The Daily to discuss the current state of the coronavirus **in the U.S. According to Fauci, officials are now starting to see some waning immunity against both infection and hospitalization several months after initial vaccination.** The infectious disease expert pointed toward incoming data from Israel, which he noted tends to be about a month to a month and a half ahead of us in terms of the outbreak.\n\n>**”They are seeing a waning of immunity not only against infection but against hospitalization and to some extent death, which is starting to now involve all age groups. It isn't just the elderly,\" Fauci said. \"It's waning to the point that you're seeing more and more people getting breakthrough infections, and more and more of those people who are getting breakthrough infections are winding up in the hospital.”**\n\n>**Fauci went on to say, \"I think … that the boosting is gonna be an absolutely essential component of our response, not a bonus, not a luxury, but an absolute essential part of the program.\"**\n\n>**According to the virus expert, researchers did not \"have to time\" to do extensive studies to determine whether two doses would be better than three, as there was a pressing need to get vaccines out to people sooner rather than later, which was \"life-saving for millions of people,\" he noted.**\n\n>And as more time passes, we'll be able to see how long the boosters keep recipients protected from COVID—but Fauci is optimistic. **”We don't have the proof yet—the proof of the pudding will be after you get people vaccinated and boosted, and we have a greater durability of protection that doesn't wane as easily.”**\n\n_______________________________________________________\n\nSounds totally safe and not at all rushed or missing a ton of actual evidence on to me. Totally not making it up as they go along.\n\nIt also doesn’t seem like we’re aggressively pushing something that we’re lacking in any crucial data at all. \n\n100% SAFE AND EFFECTIVE GUYS… just, like, trust us, k? FULL SPEED AHEAD BOZOS!!\n\n…… /s (obviously)"}, {"title": "It's Done! It's finally finished! 285hrs, 5,000m of yarn, 66,800 stitches. Weighing in at 5.5lbs. I can't wait to give it to my friend!", "body": ""}, {"title": "Finished up another sweater!", "body": ""}, {"title": "Anna Karenina. Damn.", "body": "Just finished part one, and don’t wish to have it spoiled but just need a place to let out what I feel so far. This is truly the greatest novel I have ever read and I’m glad I waited till now that I’m in my later 40s. I feel as though I can appreciate it more. I’m amazed at how Tolstoy is able to describe the slight loss of love that happens after a new infatuation.  When Anna returns from Moscow and describes how her husbands ears seem weird and even describes her own child slightly less glowing as before she went to Moscow.  As someone whom has lived life and experienced similar things, I read that and realize the human condition is and has been the same throughout history. This is truly the best thing I’ve read in my life so far !"}, {"title": "[WIP] Epic Pokémon 95% Complete! Woohoo!!!", "body": ""}, {"title": "Mom, I had a really hard week. I’ve been sober for 11.5 months and I think I might relapse today.", "body": "It started with family drama on Sunday and Monday. I’m very private but shared some personal stuff about my open relationship and upcoming divorce with my mom. Who went and immediately told my dad, who didn’t know about my open relationship at all and called me upset and told me how disappointed he was. My mom apologized and I forgave her but I don’t feel supported by either of them, obviously.\n\nI saw friends later in the week and had a good time, but then it turned out we had forgotten my friend’s birthday and she was really upset. I tried to apologize and figure out how to make it better. I’m still trying but I’m having a hard time. I want to be a good friend but I don’t feel like I have much to give right now.\n\nMy boyfriend and I were supposed to have a fun day together on Friday since I took the day off. He suggested massages and then the movies. But he didn’t find any place that could do massages on Friday in time. I did, but he said they were too expensive and cancelled them. He tried to book another place but booked the wrong day so he cancelled those too. At the last minute he said we could re-book the expensive place but of course they couldn’t do it anymore. He also didn’t get any movie tickets like he said he would. I told him I really could have used a day of quality time and felt upset that he didn’t follow through on what he said he would do. He ignored me. I told him I didn’t feel supported by him and I really needed it. He ignored me again. This man is 40 years old and we have been dating for over 4 years. I don’t think I’ll ever get the support I need from him.\n\nSo I’m at my soon-to-be ex-husband’s apartment by myself with the cats I abandoned to live with my new boyfriend. I can’t think of anything to do to feel better except sleep or drink. And I already slept like 16 of the last 24 hours.\n\nI might just go to the store and get a bottle of booze. I don’t know what else to do."}, {"title": "I actually want to struggle", "body": "I'll probably feel differently later but right now I'm fantasizing about living in a cheap shitty apartment, filling my fridge with the same 3 healthy meals, and working 50 hours a week while finishing my bachelors online.\n\nI was a pussy and a brat and a coward most of my life. At 23 I finally had the epiphany that my life is completely my responsibility and that I can't play victim anymore.\n\nTaking responsibility even if it means a lot more work makes me happier than I've ever been. It gives me a sense of control over my life and hope."}, {"title": "Is Russia preparing to Invade Ukraine and what are the consequences of such actions ?", "body": "From the news , Russia is amassing large contingent of troops on Ukrain border . In the same time , we have a crisis of immigrants on Poland Belarusian border and Russian blackmail on gaz supply to Europe .\n\nCan Russia attempt a full invasion and annexion of Ukraine and what are consequences of it ?"}, {"title": "The Trump White House silenced health experts trying to warn the public about COVID-19, new testimony says", "body": ""}, {"title": "Hundreds of shoes and handwritten notes at a California school representing the children who will be leaving if the vaccine mandate becomes a requirement to attend school", "body": ""}, {"title": "What I learned from each of my exes", "body": "Every relationship is a learning experience. The ones that don’t work out teach you as much as the ones that do, sometimes more. Here’s what I’ve learned from relationships so far.\n\n**#1 - Codependency Maximus**\n\n* When everyone tells you a relationship is a bad idea, they’re probably right.\n* If the thought of getting someone pregnant and being tied to that person terrifies you, that’s a red flag worth listening to.\n* Saving someone is not the same as loving them.\n* Choosing a partner means choosing their family too.\n\n**#2 - The Friend I Should Not Have Dated**\n\n* Moving in together when things are rocky won’t make it better.\n* If you don’t know what your needs are, no one can meet them.\n* If you don’t ask for your needs to be met, no one can meet them.\n* There are some incredibly good people you will care about a lot that you should not date. \n* Staying friends with exes will piss off A LOT of future partners. Every relationship is different, but know this is a risk.\n\n**#3 - Saying ‘I Love You’ After 3 Weeks Is A Bit Soon**\n\n* If you don’t have an identity outside your relationship, you’ll have to build one from scratch when it ends.\n* Standing up for yourself is never a bad thing. The right partner will respect it. The wrong partners will remove themselves from your life sooner.\n* How will you feel if the things that bother you now get worse? Being with someone for decades compounds the good as well as the bad\n\n**#4 - Long Distance Drama**\n\n* If you know on the first date that it won’t become a long term thing, be honest about that.\n* Being useful is not the same thing as being loved.\n* Petty shit is a red flag. Mature people care more about you than being right.\n* Relationships should not be rushed. It takes time to get to know someone. If you rush into something you are just making an important decision with less information.\n\n**#5 - Great Teamwork But Wrong Game**\n\n* Having someone who can fight for you is good, but only if you have something worth fighting for.\n* It’s okay to ask for your needs. It’s not okay if stating your needs gets punished.\n* Just because it’s the best relationship you’ve had doesn’t mean you should settle if not all your needs are met.\n* If you start dreading your time with someone or wishing you weren’t with them, just end it. You’re wasting both people’s time by dragging it out.\n* It’s not always possible, but dating people who have strong friendships means you won’t have to be 100% of their support network.\n\n**Recommended reading:** If this post resonated with you, I highly recommend 7 Principles of Making Marriage Work by John Gottman. To be honest I read it when I was single. It helped me recognize some of the things I had been doing wrong, and also taught me what to do differently next time. It also showed me some warning flags so I could steer things if I saw danger signs. The authors have tens of thousands of research hours with many couples, so I’d encourage you to benefit from what they learned. There’s a lot of relationship patterns described in the book, you don’t have to learn everything the hard way (just some things)."}, {"title": "Meanwhile, Steve Bannon Is Reminding Everyone That the Right Is Very Much Trying to Destroy Democracy", "body": ""}, {"title": "Only bots are allowed to respond to this thread. Real humans upvote but not comment.", "body": "This is a test to see if bots are replying to posts in this sub."}, {"title": "You need to take responsibility for your life.", "body": "One of the biggest differences between me now and me 3 years ago is simple: I’ve taken responsibility for my life.\n\n\nNow what I mean when I say taking responsibility, is accepting and taking ownership of my life. \n\n\nI am responsible for my life, and everything that affects me is my responsibility to deal with.\n\n\nAnd you need to be responsible for yours. You need to be responsible for your health by exercising regularly and eating well, you need to be responsible for your social life and ensuring you are social and maintaining friendships, you need to be responsible for everything that affects you. And I'm going to tell you how to get there.\n\n\nI see a lot of young men in particular, who are angry at the world, they think that life isn’t treating them the same way it treats others.\n\n\n And guess what…It isn’t.\n\n\n Some people have far greater advantages than others, and some people are hit with terrible misfortune and suffering. And whichever end of the spectrum you are, you are responsible for your life. \n\n\nResponsibility isn’t the same as fault: It’s not your fault that your parents are rich, it’s not your fault your dad died. But you are responsible for how these things affect your life, you choose how you deal with them.\n\n\nSome people have lost family and consequently turned to drugs and alcohol, others have lost family and started charities or companies. \n\n\nThere are ways to deal with every situation, some better, some worse.\n\n\nYour circumstances don’t define you, your response to them does.\n\n\nI hear all the time on self-improvement forums “I can’t do that because…”  I don’t care about the because, take some fucking responsibility and find a workaround. \n\n\nThe first step to gaining some responsibility for your life is realising that you are someone worth helping. You deserve someone to look after you and make sure you can be the best version of yourself possible. Make that person you. Recognise that responsibility isn’t a negative thing, It’s a privilege. \n\n\nYou GET to be responsible for your own life. \n\n\nIt’s incredible freeing to know that, while life may fuck you, ultimately you are responsible for your misery. You are also responsible for all of your achievements, successes and happiness. \n\n\nSo fucking own it.\n\n\n\nThe second step is starting to act like you are responsible for your life.\n\n\nThere is no third step.\n\n\nIs your job shit? It’s your responsibility to either try and make it less shit, or quit.\n\n\nDo you feel like shit? That’s your responsibility to figure out why and make changes\n\n\nAre your relationships shit? Take some responsibility for it, cut people off if you need to, try harder, just know that It’s your responsibility to improve them.\n\n\nIs your body shit? That’s your responsibility too bozo, go for a run or something idk.\n\n\nNot sticking to your goals? Actually NOT your responsibility - I’m joking, of course it is you muppet.\n\n\n\n\nYou don’t have to be perfect, you just have to try. Take responsibility, do the work.\n\n\n\nJoe "}, {"title": "Get around dislike removal", "body": ""}, {"title": "GOP silence deafening as post-Jan. 6 threats of violence escalate", "body": ""}, {"title": "Mom, I’m gay. Is that okay?", "body": "I just want you to love me. I just want to be accepted. I want to not feel like I’m an embarrassment to the family. I want to bring home a boyfriend and have you be proud of me."}, {"title": "Finished this dress a few weeks ago and today I wore it for the very first time on my grandma's birthday. It took me a few weeks and lots of time but it was totally worth it🥰 my personal opinion: it looks in reallife way better than on the pic😅😊", "body": ""}, {"title": "[FO] Hokusai's Great Wave as seen through the window", "body": ""}, {"title": "The rabbit hole is deep..", "body": ""}, {"title": "People of Melbourne have risen up", "body": ""}, {"title": "Finally done! Plenty of mistakes and I’m never using Sultan Deluxe cotton again, but I don’t hate it.", "body": ""}, {"title": "Crocheting is NOT knitting", "body": "I'm so irritated that it is SO HARD to look up knitting patterns. When I find one I like it's crochet. They are very different! I don't know how to crochet! \n\nI like knitting stuffed animals but cute patters are so hard to find."}, {"title": "[FO] Finished my Christmas ornaments surprisingly early this year", "body": ""}, {"title": "Ron Paul was right", "body": ""}, {"title": "Finished an Astraeus jumper. Was intimidated by the colourwork to begin with, but I’m so glad I decided to go for it anyway! (With bonus float shot)", "body": ""}, {"title": "Its been long dead when Hillary & Obama could ignore subpoenas and nothing happens", "body": ""}, {"title": "\"You need a little education\": GOP lawmaker confronts Tucker Carlson on U.S.-Ukraine ties", "body": ""}, {"title": "[FO] Coworker put in her two week notice, so I had to make her something quickly! Info in comments.", "body": ""}, {"title": "U.S. Government Funds First Therapeutic Psilocybin Research in 50 Years", "body": ""}, {"title": "I just love seeing your creations and progress here <3", "body": ""}, {"title": "Documents Expose 'Staggering Pattern of Political Interference' in Trump's Covid-19 Response | \"Top elected officials preferred to keep Americans in the dark and set policy based on political considerations, not science,\" said one former CDC adviser.", "body": ""}, {"title": "Two of the three judges blocking Biden's vaccine rules were appointed by Trump, a sign of how thoroughly he reshaped the judiciary", "body": ""}, {"title": "Athletes are collapsing on the field at 60x the normal rate in 2021. It's probably nothing...", "body": ""}, {"title": "This is some of the worst double-dose of Propaganda", "body": ""}, {"title": "If you are vaccinated and feel unsafe around groups of people who are unvaccinated please explain your reasoning.", "body": "Genuinely curious on your thought process…"}, {"title": "Not the best photo to show off this sweater I know but I’m so proud of it. Finished it over a month ago but only wearing it now. Thanks to everyone on here who gave me advice on seaming (I went with good old mattress stitch)!", "body": ""}, {"title": "Americans Need to Learn to Live More Like Europeans", "body": ""}, {"title": "After 400 years lost, 'cursed' novel of Spain's imperial age is finally published - Four hundred years after it was written, a lost and supposedly cursed Golden Age novel chronicling the splendour, adventure and violence of Spain’s imperial zenith has been published for the first time.", "body": ""}, {"title": "HOTH: The most fun blanket I’ve made", "body": ""}, {"title": "Melbourne, Australia: Health bill and vaccine passport protest (Nov. 12, 2021)", "body": ""}, {"title": "What are the Stereotypes of Someone who Only Reads Nonfiction?", "body": "I [33f] recently went on a date with a guy [35m] who seemed cool and that we have a bunch in common.  When we started talking about books and what we've been reading, I said I mostly love nonfiction and detailed a few of the books I've recently read about the history of WWII, Churchill, Bad Blood by John Carryrou, American Kingpin by Nick Bilton about the Silk Road, and The Least of Us by Sam Quinones about the fentanyl/P2P meth epidemic. \n\nHe seemed put off that I loved nonfiction, made a face with big eyes and a \"oh, you're one of *those*\" comment.  It got kinda awkward so I just let it lie and we changed the subject to talk about his job.  \n\nWhat are one of those?  What does it say about someone if they love nonfiction? \n\nI've read a lot of fiction but lately I just really love well researched nonfiction.  Should I not tell dates this?  \n\nThanks for any thoughts!"}, {"title": "Newly Released Documents Show Exactly How Trump Admin. Undermined CDC During Pandemic", "body": ""}, {"title": "Opinion: Sorry, Mr. Trump: Executive privilege is President Biden’s to assert", "body": ""}, {"title": "Kinzinger says he hopes Bannon indictment sends 'chilling message'", "body": ""}, {"title": "Dems push Biden on domestic flight vaccine mandate as millions plan to travel for holidays", "body": ""}, {"title": "You guys the push to vaccinate children is really getting to me.", "body": "In the US the numbers being reported are not accurate, doctors are being paid to list deaths as COVID, the vaccine is dangerous especially for children and can lead to lifelong heart conditions, now osha is trying to force everyone to be vaccinated otherwise they cannot work. I don’t think COVID is 100% a conspiracy, but the news is not reporting facts and governments are using it to gain more control and power over their people. I am a Christian and I believe everything that is going on is ultimately demonic and people are really blinded by darkness. But I feel like I’m outside a building that is on fire and I’m trying to scream at the people inside to get out of the building but they are just looking at me like I am a crazy person. I guess I need to feel ok that I and my family are safe and pray. It’s just painful to see it all happening."}, {"title": "Whitmer vetoes bill to forgive penalties imposed on businesses for violating COVID-19 orders", "body": ""}, {"title": "Need opinions. Do these colors work together? Should I keep going?", "body": ""}, {"title": "My latest crochet cosplay: Anna from Frozen 1", "body": ""}, {"title": "“Look, I got vaccinated, and people took me to task for that. And I thought, ‘All right, I’ll get the damn vaccine.’ Here’s the deal, guys: I’ll get the vaccine, you f***ing leave me alone. And did that work? No. So, stupid me.” Jordan Peterson Regrets Getting The COVID vaccine.", "body": "[video ](https://np.reddit.com/r/AskThe_Donald/comments/qssrek/jordan_peterson_says_he_feels_stupid_for_drinking/?utm_source=share&utm_medium=ios_app&utm_name=iossmf)"}, {"title": "Sanders Leads Senators in Backing Kaiser Permanente Workers Before Planned Strike", "body": ""}, {"title": "I live in Italy unvaxxed, life is hard", "body": "Here you need a greenpass to go anywhere inside, or take a rapid train. \nFortunately I'm not working but if I did, I'd have to get tested every 2 days to have a greenpass.\nGoing out with friends is becoming difficult as it's getting cold and nobody wants to eat/drink outside. I started feeling bad as I have to ask friends to eat outside with me.\n\nI'm the only person who's not vaxxed among people I know and everyone is like \"Isn't it easier just to get vaxxed?\" F no I'll be the last one to get a jab, even if I have to lose all my friends. \nFu*k greenpass.\n\nIt seems like their goal is to eliminate the rebels and make a society full of submissive sheep."}, {"title": "The product you were sold vs. the product you got", "body": ""}, {"title": "Graduating college at 25", "body": "I'm graduating college this summer at age 25. I have a lot of conflicting emotions ranging from shame to pride. I've been working full time since I was 14 as well as being a caregiver to some stressful family and legal circumstances.\n\nFor those of you in this community who graduated later, how do you let go of the internalized shame of finishing later? Rationally, I know I am proud of myself for making it this far as a caregiver and full-time worker and part-time student. But my emotions surrounding \"what should have been\" haven't seemed to have caught up."}, {"title": "Sinema's shift: 'Prada socialist' to corporate donor magnet", "body": ""}, {"title": "Pentagon says it will respond to Oklahoma's governor after state's National Guard rejects its vaccine mandate", "body": ""}, {"title": "\"The data for Covid vaccine trials isn't available and won't be available for YEARS...Without Data It's Not Science\" -- Dr. Doshi", "body": ""}, {"title": "Never Forget Joe Biden went on CNN and alleged, with zero evidence, that Kyle Rittenhouse was a member of an Illinois white supremacist militia.", "body": ""}, {"title": "Friend of mine is pregnant, so I made her this gift", "body": ""}, {"title": "[WIP] I've been working on this blackwork world map for like 2 years and I'm finally halfway done!", "body": ""}, {"title": "started learning on halloween, now i made myself a hat", "body": ""}, {"title": "Just finished Pet Sematary for the first time", "body": "And what a roller coaster.\nI’ve seen the 80’s version a few times, so I new most of the big beats going in, but you know how things change when they get adapted (or are buried in tainted land).  I was fascinated by the descriptions of the pets not being quite right after they came back, and how Judd’s parents immediately knew what he had done. \n\nI’d have liked to get a historical story of someone else being brought back, as a lead in to the direct experience Judd shared.\n\nI know some people hate ambiguity, but I loved not knowing caused Victors spirit to be bound to Lewis and Ellie. Or how he had knowledge of the burial ground and how it would twist what it brought back. \n\nI also feel the book ending is better than either of the movies. The cliff hanger just hits better than seeing Rachel with the knife, or the zombie family."}, {"title": "Mom, I got engaged", "body": "Hi internet moms,\n\nI got engaged last night. Tried to reach out to my mom for the first time in may months, who told me to \"have a nice life\" and that she didn't want to be involved. I would love to feel some mom-type joy. Thanks <3"}, {"title": "I just got a Let’s Go Brandon shirt and wore it to the grocery store.", "body": "Five people went out of their way to tell me how much they like it. My 6 year old asked why everyone was complimenting my shirt, it’s just a T-shirt 😂 It’s not looking good for Biden."}, {"title": "[WIP] I see you~! (Autumn Tiger by Unconventional X Stitch, 1/3 done)", "body": ""}, {"title": "[FO] Cruella Cross Stitch by BirdiesCrossing", "body": ""}, {"title": "After 6months of work, I finally finished my sunflower bag!", "body": ""}, {"title": "About halfway done with my first Persian tiles blanket. 18 days of work so far.", "body": ""}, {"title": "[FO] peppermint purple hints of music and hints of Art Deco. Ready to wrap for Christmas.", "body": ""}, {"title": "What is Philippa Gregory's deal with incest?", "body": "I am a longtime reader of Philippa Gregory and a history teacher. I know that she flubs the history or completely makes things up and while it makes me grit my teeth, I can get over it.\n\nBut seriously, what I can't get over is her insane obsession with incest. That's what makes things bad for me, like wtf is her deal with incest? Let's take it apart piece by piece:\n\n1. The Other Boleyn Girl: George Boleyn is frequently depicted as intimately kissing both Mary and Anne Boleyn and then it's heavily, heavily implied that he has sex with Anne, his own sister. \n2. The Boleyn Inheritance: It is implied that Anne of Cleves brother has a sexual interest in her and likes to see her whipped because he gets sexual pleasure from it. Also, a 16 year old Katherine Howard tries seducing a 60 year old Thomas Howard, her UNCLE.\n3. The Queen's Fool: Teenage Elizabeth has a relationship with 40 year old Thomas Seymour, her step-father. I know it doesn't really count but it infuriates me that PG blames it on Elizabeth being a \"whore\" and not Seymour, who should be a mature man at 40.\n4. Constant Princess: Henry VIII is instantly in love with Catherine of Aragon, despite being 10 years old, and the biggest attraction of all is that his brother Arthur had her first.\n5. The White Queen/Cousin's War Series: Isabel Neville and George and Anne Neville and Richard III are all first cousins who marry which, while it could be excused, Richard III also has a sexual thing with his niece. Like wtf, the Hapsburgs and their incest are only an ocean away and we know it's a seriously bad idea when nieces and uncles get together romantically, so PG why would you do this? Are you blind to what happens when uncles-nieces reproduce together?\n6. Wideacre Trilogy: This one takes the cake for me. You have a brother and a sister having sex and reproducing two kids: a boy and a girl. Then, those two incest kids get together and reproduce again, leading to another daughter.  And nobody has any mental issues despite being the product of 2 generations of brother-sister incest. \n\nI don't care how hot it is, I cannot get past the close incest. Like, at least 4 books have cases with brother-sister incest. Has PG ever had a sibling? Cause I do and my husband does and most people with sibling's I talk to could not stand them long enough to form some kind of romantic interest in them. In my experience, nobody gets you to crazy rage faster than a sibling does.\n\nWhy is she so interested in incest?"}, {"title": "Lord Nibbler, the newest addition to my nerdy crochet collection.", "body": ""}, {"title": "It Pays to Be a Conservative Democrat Blocking Popular Legislation", "body": ""}, {"title": "Delco election official sues Donald Trump, others for backlash over false voter fraud claims", "body": ""}, {"title": "Things are going to be okay.", "body": "This year, 2021 has been a fantastic year for me. I went back to school and restarted my bachelors after a small hiatus. I found what I wanted to do in life. I started training and lost 40 pounds. I've packed away a lot of money after working through the whole pandemic. And I've finally got the chance to buy a car I've always wanted.\n\n&#x200B;\n\nThis year has been great, to many more!"}, {"title": "I won a game of yarn chicken", "body": ""}, {"title": "39,600 stitches later", "body": ""}, {"title": "The Real Source of Inflation? Consolidated Corporate Power and Greed", "body": ""}, {"title": "[FO] standing appa! pattern is self drafted", "body": ""}, {"title": "Need to use up some scraps and bring some warmth to your community? (x-posted from /r/HumansBeingBros)", "body": ""}, {"title": "Colorful Blanket ( Designed By Me ).Do you Like it?", "body": ""}, {"title": "A New York man was arrested after allegedly issuing a death threat to GOP Rep. Andrew Garbarino over his vote for the bipartisan infrastructure bill", "body": ""}, {"title": "[FO] Finally finished Hocus Pocus by the Prairie Schooler in between moving house! Onto my other WIPs that I’ve preen neglecting", "body": ""}, {"title": "GOP Rep. Adam Kinzinger says he hopes the indictment of Steve Bannon for contempt of Congress 'sends a chilling message'", "body": ""}, {"title": "Elite Kek", "body": ""}, {"title": "I know a lot of people who regret getting the vaccine. Don’t know anyone who regrets not getting it.", "body": "Vaxed people: \n\nCan still get covid. \n\nCan still spread covid. \n\nCan still die from covid. \n\nCan potentially die from the vaccine.\n \n \nUnvaxed people: \n\nCan still get covid. \n\nCan still spread covid. \n\nCan still die from covid. \n\nCannot die from the vaccine."}, {"title": "Why isn’t anyone talking about this?", "body": ""}, {"title": "[PIC] I think I can… I think I can… Thread chicken! Pattern found on Pinterest.", "body": ""}, {"title": "Wilbur Smith: Popular Zambian-born author dies aged 88", "body": ""}, {"title": "Crochet bee 🐝", "body": ""}, {"title": "First FO post on here after lurking for awhile! Inspired by the post linked below, took me 4 months and soooo much yarn (i underestimated at first and therefore there are some color inconsistencies lol)", "body": ""}, {"title": "The Merchant and the Alchemist's Gate soothed and crushed my soul. Beautiful story.", "body": "\"**The Merchant and the Alchemist's Gate**\" is a sci-fi piece by  [Ted Chiang](https://en.wikipedia.org/wiki/Ted_Chiang).\n\nI've always enjoyed Chiang's work but this is the first time I've come across this particular story. It may be my favorite work from him to date. It made me feel more human and alive, as his work always does. There was such a beauty in this one, however. It choked me up."}, {"title": "Jan. 6 probe threatens fragile Trump-Pence peace", "body": ""}, {"title": "Hitting rock bottom..", "body": "As the titles says, current stage of my life atm. I have absolutely nothing, lost my job, €0 in my bank account. Shits fecking tough but as the saying goes.. 👇🏻\n\n “Rock bottom has built more heroes than privilege”. \n\nTo anyone in a similar situation, you’ll make it through I believe in you, no matter how bad you may think it is. Call to god seek out his will! 🙏🏻 \n\nBlessings to all you beautiful people out here trying to make it in this crazy world."}, {"title": "Does anyone have a pattern that is close to this scarf?! Trying to make a dupe of this $80 scarf from Anthropologie that my sister wants for Christmas!", "body": ""}, {"title": "Recently finished object 🥰 using leftover yarn from a shawl", "body": ""}, {"title": "Social media stays in business by draining your life force", "body": ""}, {"title": "Tens of thousands protested in Melbourne today against new pandemic law that would give the executive indefinite emergency powers to \"protect public health\".", "body": ""}, {"title": "Baby Blanket and Teddy for a coworker", "body": ""}, {"title": "I finished this blanket on the same day I watched Rocketman for the first time… coincidence or should I quit my job and become a rockstar?", "body": ""}, {"title": "My first Christmas gifts are shipped - all the way to Sweden!", "body": ""}, {"title": "What was a book or series that you were obsessed with in elementary school (ages: 5 - 10) or middle school (ages: 11 - 13)?", "body": "I hear a lot of times that a lot of readers were reading fanatics when they were younger. Although I wasn’t much of a reader in elementary school (i simply did not have the focus to finish a book), I was a reading fanatic in middle school. My favorite series at that time was The Lunar Chronicles by Marissa Meyers. My favorite book was definitely Fangirl by Rainbow Rowell. I still go back to those books to get that feeling of nostalgia."}, {"title": "New random brioche scarf", "body": ""}, {"title": "They found a MILLION parents willing to jab their kids, but can't get a few 'Likes' on YouTube?", "body": ""}, {"title": "Blankets are always so satisfying to finish.", "body": ""}, {"title": "[FO] Anotha one! Absolutely loving these holiday vehicles", "body": ""}, {"title": "I finished my first top, it’s nothing special but as a beginner I’m proud :)", "body": ""}, {"title": "Now the GOP Is Coming for John Deere Workers", "body": ""}, {"title": "I hate how my self-improvement journey consists of pain and suffering, and that there's absolutely nothing glamorous about it, unlike all the YouTubers and TikTokers out there!!!", "body": "There, I said it. 😤"}, {"title": "H.Res.789 - Censuring Representative Paul Gosar", "body": ""}, {"title": "In Florida, two strikes and you’re in prison forever", "body": ""}, {"title": "[FO] I stitched Rose and Sophia from the Golden Girls. Still pretty new to cross stitching and this is my second project on 14 count aida. CCW! (Pattern by Haley Pierce-Cox)", "body": ""}, {"title": "It’s finally done! Bag for my sister", "body": ""}, {"title": "Making a cafe for my niece! Think I might do a burger next, easy to do too", "body": ""}, {"title": "Start em young!", "body": ""}, {"title": "Texas schools resist Republican request for records on classroom books - Austin and Dallas districts say they won’t respond to lawmaker’s letter targeting 850 books, many on race and LGBTQ+ issues", "body": ""}, {"title": "[FO] took me a week to stitch this one! What do you think? Pattern by stitchrovia", "body": ""}, {"title": "Who else thinks the so-called fact-checkers are full of shit?", "body": ""}, {"title": "What,if anything can the EU do about LGBTQ+ rights in Poland?", "body": "Poland is one of the worst places in the world to live as a member of the LGBTQ+ community. Multiple parts in Poland are labeled as LGBT free zones,where law enforcement can kick people out for being gay. Since Poland is apart of the EU is there anything that the EU can do about it?"}, {"title": "Watch Novavax very closely over the next few months", "body": "Novavax utilizes a standardized vaccine approach, similar to the shingles and hepatitis vaccines that have been out for many years. It's a tried and true platform. Recently, the company received their first EUA in Indonesia and is applying in other countries. \n\nThey have asked for a meeting with the FDA to discuss the application here in the United States and hopes to submit by end of year. \n\nIf the FDA is serious in ending this pandemic, they will FASTLINE the vaccine. \n\nIf the FDA is deep in the pockets of Pfizer and Moderna, they will slow track the process or outright refuse the EUA and make them apply for standard approval stating \"there's already sufficient supply of vaccine\". Standard approval takes years.\n\nSo watch it closely and I think this will reveal what's really going on.\n\nhttps://uk.finance.yahoo.com/news/novavax-asks-for-fda-meeting-after-first-global-authorization-for-covid-19-vaccine-ceo-191036628.html"}, {"title": "[PIC] All 5 autumn napkins completed in time", "body": ""}, {"title": "Newly finished light saber", "body": ""}, {"title": "[WIP] Avengers jacket", "body": ""}, {"title": "31 Seconds of Glorious Freedom In Australia! Bring it Australia!", "body": ""}, {"title": "Miranda Priestly voice: “the blanket stitch for a blanket…how…groundbreaking”", "body": ""}, {"title": "Finished a baby blanket for my niece for Christmas! I love it so much I might just make it in adult size!", "body": ""}, {"title": "Figured you might appreciate my knitting setup", "body": ""}, {"title": "Arizona: School board President Jann-Michael Greensburg kept publicly viewable dossier on parents that included their social security numbers, divorce records, financial information, and online activity.", "body": ""}, {"title": "[FO] Finished my first sampler. I'm pretty pleased with it", "body": ""}, {"title": "I AM GOING TO GRAD SCHOOL", "body": "After working hard to get good grades and test scores for so long, I finally got into a top notch grad school and I'm so happy!!! My family has never been supportive so I've been feeling a lil down about it. Just wanted to share"}, {"title": "Should I put backing on this or should I just face the pain and weave in all the ends? Opinions wanted!", "body": ""}, {"title": "Love this pattern. I started yesterday and almost finished it! Just need a ring for the last round to attach and unfortunately I can't buy it tomorrow because it's Sunday and all shops are closed here :/ maybe I'll just start the next one", "body": ""}, {"title": "Lost my job due to Jab Mandate. Here was my final day end report I sent to my supervisor/boss/coworkers.", "body": " \n\n2+2 does NOT equal 5.\n\nGood Afternoon,\n\nIt’s been a pleasure working with and getting to know each and every one of you. I’ve learned a lot and will forever treasure the memories and laughs shared.\n\nAs XXXXX mandates the Covid19 vaccine while presenting misleading and conflicting information, I cannot in good conscience continue to work for an organization that does not take into account the autonomy of the individual nor respect our right to an ‘informed’ consent.\n\nIn *1984 (Book)*, the statement that 2 + 2 = 5 refers to the manipulation of truth. Winston (the protagonist) himself insists on the objectivity of truth, represented by the contrasting statement \"2 + 2 = 4.\"\n\nOrwell's warning, however, is that truth itself can be manipulated and undermined by the State.\n\nMoving forward, I can be reached on my personal cell and email XXXXX.\n\nIn conclusion, I leave you with three ideas-\n\n                1. \"The emperor has no clothes!\"\n\nThis is a reference to a fairy tale called The Emperor’s New Clothes. In it, the emperor is a vain man overly concerned with his clothes spending a lot of money on them. Two con men come to town and offer to make the best clothing ever with special properties that make the clothes invisible to those unfit for their job or those that are stupid. The emperor hires them but they make nothing at all. As people come to check on the progress, they see nothing but fear they must be stupid or unfit for their job so they shower it with praise. The emperor finally comes to see the progress and is equally afraid to admit he see’s nothing. The entire kingdom eventually praises the clothing and how magnificent it is. Upon its completion and unveiling in the town square, the youngest boy in the crowd (life imitates art I guess?)  speaks out that the emperor is wearing no clothes. Everyone finally admits they see nothing either including the emperor. The lie is exposed. The emperor is now forced to pretend to march around with no clothes, parading as if he does.\n\nThe lesson is that the fear of consequences will often lead people to publicly agree to things they don’t privately believe in for a variety of reasons. Furthermore, the “emperor” will always proudly continue the lie despite his own knowledge of the truth and being publicly outed. It is easier and less painful to tell a few more lies and look foolish than to admit being foolish. We see ridiculous art like a picture of soup hailed as genius because authority figures say so and we agree because we don’t want to seem unsophisticated. \n\nEvidence proves, or lends credibility to, a theory and yet the authorities continue to push the disproven narrative.\n\n[https://youtu.be/7Ym0u-KweN4?t=6](https://nam02.safelinks.protection.outlook.com/?url=https%3A%2F%2Fyoutu.be%2F7Ym0u-KweN4%3Ft%3D6&data=04%7C01%7CRaymond.Pichardo%40Lifespan.org%7C81459f8ff2374d33106008d977e293ba%7C3764e7d08fff4c8cbd1306c688fed784%7C0%7C0%7C637672637300730273%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C1000&sdata=D2mxAnPRDgo9IWfrb4A7tYqsyHDr61%2BJrxaUTEwdUmQ%3D&reserved=0)\n\n2. “When a society is predicated with a deep respect for and commitment to individual rights, the individual is king and therefore the individual is free. But when individual rights are transgressed under the pretense of public safety or the greater good, The individual turns into mere political property, which any mob, or government, or institution in power can oppress, detain, or eliminate if deemed necessary.\n\nAt times such as \\[these\\], in standing on the side of freedom we unite ourselves in spirit with all other guardians of freedom across the globe. Or, as Albert Camus states, “I rebel – therefore we exist.” - Academy of ideas\n\n 3. “For believe me! — the secret for harvesting from existence the greatest fruitfulness and the greatest enjoyment is: to live dangerously! Build your cities on the slopes of Vesuvius! Send your ships into uncharted seas! Live at war with your peers and yourselves! Be robbers and conquerors as long as you cannot be rulers and possessors, you seekers of knowledge! Soon the age will be past when you could be content to live hidden in forests like shy deer! At long last the search for knowledge will reach out for its due: — it will want to rule and possess, and you with it!” - Friedrich Nietzsche\n\nGod Bless,\n\nPalito415\n\nTruth Seeker"}, {"title": "[FO] Finally finished stitching my fiancé's favorite Pokemon", "body": ""}, {"title": "I love knitting mittens :) (well the first one of a pair at least)", "body": ""}, {"title": "Starting a new project and the yarn came with this wooden thing. How do I use it? The yarn fits though the 3.75 hole. The package says to use a 5mm hook. Any tips welcome.", "body": ""}, {"title": "[WIP] I’m now 27 out of 30 pages done! Maybe I will actually finish in this lifetime!", "body": ""}, {"title": "My evil eye sweater is complete!", "body": ""}, {"title": "Making hexagon sweaters is my obsession lately.", "body": ""}, {"title": "Oklahoma National Guard goes rogue, rejects COVID vaccine mandate after sudden change of command", "body": ""}, {"title": "Anyone else feel like we're at the end of a long boring Monopoly game?", "body": "The 0.01% people got all the good real estate back in the 1800's and since bought everything else, leaving the rest of us in debt just lugging around the bord aimlessly, trying not to go to jail. How long do we keep playing, or is it time to upend the board and start over?\n\nThe Rothschild family took over the banks, the Vanderbilts had the railways and Carnegie/Rockefeller had just about everything else of value by early last century. How does the world compete with that kind of money, are we destined to be like Wall-E and the Buy n Large corporation owning everything? Their catch phrase is even \"You will own nothing and be happy\" Sounds a lot like slavery to me."}, {"title": "Anyone else feel like they have no incentive to comply? I have no reason to return to \"normal\"", "body": "Pre pandemic: dead end (but fulltime) job, few friends, no relationship, no kids, no way of affording a house.\n\nPost pandemic: Same, except I've moved into my parent's cabin and work part-time.\n\nSociety gave me absolutely zero fucking reason to comply to these bullshit mandates. My life before wasn't anything spectacular, and the idea I'd inject myself with this jab to go back to THAT is laughable.\n\nThe only thing I regret is the relationship/marriage and kids. In a better world,  that would be great. Now, I'd rather not. I know the depop agenda is a thing, but I have stopped caring. I'm a woman and the dating scene depresses me. Too bad but at the same time, that will be one less thing I have to worry about. Never understood that shit anyway. \n\nI laughed when Jordan Peterson thought he'd be \"left alone\" if he just got the vaccine. Anyone who struggles to fit in to society knows that it NEVER changes."}, {"title": "How to stop loose talk ?", "body": "I don't talk a lot (I am generally reticent) but when I do talk I talk a lot without thinking about the ramifications of my words. That's the reason I don't talk much."}, {"title": "Unvaccinated will have ‘miserable, very lonely life,’ top Australian doc warns", "body": ">The head of the Australian Medical Association in Queensland has issued a dark warning to those who refuse anti-Covid vaccination, saying they not only face fines and fraud charges, but will be separated from the rest of society.\n\n>“Life will be miserable without being vaccinated. You won’t be able to hide,” Dr. Chris Perry said this week, while speaking to Channel 9 television network in Australia.\n\nhttps://www.rt.com/news/540197-australia-unvaccinated-miserable-lonely/"}, {"title": "I've just finished this Hat and and I have fallen in love with the Flower!", "body": ""}, {"title": "Finally finished this jumper as a Christmas gift for my mum!!", "body": ""}, {"title": "Federal Judge Slaps Down Biden Vax Mandate, Taiwan Stops Child Pfizer Injections", "body": ""}, {"title": "It took me a long time to do, but I'm very proud of the result :) I put the pattern link: https: //www.etsy.com/ca-fr/listing/275950854/crochet-pattern-no- 1616-sea-turtle-by? Ref = hp_rv-4", "body": ""}, {"title": "[FO] Mouse cross stitch pattern by Lolalottashop on evenweave. Coffee stains by me.", "body": ""}, {"title": "[WIP] Just finished the bumblebees on first side, done 1 over 1 on 32 count linen. Need to rest my eyes now. Next is some blackwork work. It is Bumblebee Biscornu by Sweetheart Tree.", "body": ""}, {"title": "The producer is not responsible, the doctor is not responsible, the government is not responsible, but if I refuse the covid vaccine which has multiple side effects, including death, I am irresponsible.", "body": ""}, {"title": "First colourwork circular yoke - really pleased. The pattern is Arboreal by Jennifer Steingass and the yarn is Garnstudio Soft Tweed mix", "body": ""}, {"title": "YouTube Removes 138,000 Dislikes From Biden Videos In Middle Of Night", "body": ""}, {"title": "Suspected witness tampering is uncovered in the Kyle Rittenhouse case as star witness Gaige Grosskreutz, who aimed his gun at Rittenhouse, had charges dropped by the prosecutor only days before being a witness in the case.", "body": "For some reason, Grosskreutz has not been charged as a felon in possession of a firearm and attempting to kill Kyle Rittenhouse, even though at the time of the event, Grosskreutz was a felon."}, {"title": "How do I stop caring?", "body": "How do I be more confident and stop caring about what other people may think about me? I want to be fun and annoying but the fear of people hating me and having less of a chance of making friends (as if it wasn't quite low) even lower. I don't know, I fear the consequences way too much and I just want some entertainment in my life but I fear bad things happening because that seems to happen a lot, I thought by the time I'm in University I'd feel more confident and reinvent myself or something but no, same old me pretty much, the anxiety crawls back up and my mind goes almost blank before making conversation, I have gotten better but it's still painful and I'm still seen as quiet and shy when that was what I didn't want to appear again after going through that in school. Fear. Fear. Fear. Fear of what people think, failing, looking like an idiot and people hating me. I still feel like an outsider because of the years and years of being one and that I irrationally feel it more often and need validation. I know self improvement for me is rooted in self hate and not wanting to be myself and wanting to be someone else but I suck 😕"}, {"title": "My First Tapestry!", "body": ""}, {"title": "Doctor Who Said He ‘Won’t Cry at Funeral’ for Unvaccinated Suddenly Dies 2 Weeks After Booster", "body": ""}, {"title": "I made my first sweater! Seemed fitting it was a hockey sweater!", "body": ""}, {"title": "Jen Psaki calls the record amount of trans people murdered in 2021 so far “devastating”. \"That’s terrible and heartbreaking to hear. It is a commitment of the President to address violence, address threats to transgender people.\"", "body": ""}, {"title": "They changed the meaning of woke to something completely irrelevant (doublespeak)", "body": "Being woke 10 years ago meant that you understood what was going on when the politicians were doing dumb shit\n\nNow the meaning of that word is raped by people who get baited into things they wouldn’t do if they were woke. And the right falls for the bait and starts hating on non woke culture which they refer to as woke (which is the propaganda)"}, {"title": "U.S. Military Hid Airstrike That Killed Dozens Of Civilians In Syria", "body": ""}, {"title": "This is a leaked video of a new Australian Quarantine Camp.", "body": " Australia is a dystopia. \n\n[https://www.youtube.com/watch?v=FGyc22ar2X0](https://www.youtube.com/watch?v=FGyc22ar2X0)"}, {"title": "Friendly reminder to trust your hooks!", "body": "I've been on and off crocheting since my teens and remember how proud I was of the tension on my earlier projects... I also vividly remember how difficult it was to push my hook through the tight stitches and my hand cramping up from sheer effort. Everytime I asked my mom for help she would be baffled, frog some parts and redo it with a relaxed tension. \n\nHere we are a decade later and I recently started crocheting again. This time I learned to trust my hooks. I used to be so terrified of dropping stitches if I didn't hold on to them tight enough. Now I trust that if I relax my tension, the hook will take care of it. I used to worry the loops would be different sizes and uneven if I didn't hold on. Now I realized that trusting my hooks will keep the sizing consistent. \n\nIt's plainly obvious, but it took me so long to get comfortable with it. When learning to crochet it can be frustrating and finicky to try and control the yarn with your hook. But please, do yourself a favor and trust your hooks! This is what they're made for and why there are different sizes. If you're still in doubt make a test swatch to obtain the right gauge. Either way, trust your hooks and relax, it makes a world of difference!"}, {"title": "So interesting story,just got a rapid covid test....", "body": "So long story short I just went an had a rapid cv19 test done. They swabbed each nostril 2x with 2 different sealed swabs. So I'm assuming 2 tests due to lack of accuracy. . .(a group of people predicted that)\nI had covid about 7 months ago and it was mild. Lost taste,smell,fatigue but in about a week I was fine again.\n\nSo as I'm waiting on my results I hear the head nurse entering the other rooms near me, telling people (4 in fact) they are cv19 positive. All were asked if vaccinated an said yes. I wasn't in the room but could hear it very well an the closest room was a man who had all his jabs who was literally shocked he had covid an border breakdown. Asking how its possible when hes vaccinated an up to date on booster's. Very Upset hes going to miss more work after he was sick from one of the boosters.(says he took the jab for his family) All the nurse could do is say I'm sorry I hate to bare the bad news,it hurts me too (nhead nurse). I felt bad for the guy who was handling it rough.\n\nAnyways about 15 more mins goes by, head nurse comes in an says your negitive for covid. I explained I once had it etc. She DOES NOT ask if I'm jabbed or boostered. Asks symptoms an all that. I explain its not like when I had covid (when I did it was mild though) I get a card saying I'm negative an some personal info on it and sent on my way. I'm NOT jabbed...not even once. Im around people all day at work from all over. The whole 6° of separation deal. I just wanted to be safe. These people who had the jab's and now have covid were not happy. The man being most upset. The nurses had no answers for him either. \n\nTheres no way these nurses dont know that the jab is b.s. at this point, it factually doesn't stop/prevent cv19 or the spread An they know it. An by the way she (nurse) was upset about having to bare the bad news these people most likely were far from the first to hear they have covid being jabbed imo. I have the card they gave me as proof but apparently you cant upload to imgur now without an account.\n\nJust figured I would share. I think people are waking up they've been had by ig pharmaceutical for money.\n\n\"Its easier to fool a person than to convince them, they have been fooled\"\n\nSorry about bad formatting."}, {"title": "Project Veritas raided and all electronics confiscated", "body": "They news is several days old - I just don't see anyone talking about it. Judge has ordered a stop to any examination of said electronics."}, {"title": "Where are you from and what were the \"high school books\"?", "body": "I was on a flight, talking to a woman who grew up in Paris, France. As a traveler, I'm always interested in what people around the world were assigned to read in high school. She gave me this list:\n\n* Bel-Ami by Guy de Maupassant\n* Germinal and L'Assommoir by Émile Zola\n* Les Misérables by Victor Hugo\n\nI'm in Canada (province of Ontario). In the last ten years, our curriculum has exploded, allowing teachers to choose ANYTHING. The Kite Runner by Khaled Hosseini (2003) trended for a time (and provided a psychological salve when Canadian soldiers were in Afghanistan imo) and Three Day Road by Joseph Boyden (2005). But in my day (late 90s)  I would bet most of my generation was assigned to read:\n\n* Lord of the Flies by William Golding\n* 1984 by George Orwell\n* Macbeth by William Shakespeare\n* Harrison Bergeron by Kurt Vonnegut Jr. (short story)\n\nWhere are you from and what were the most common books/short stories assigned in high school?\n\n**UPDATE**: I'm making myself a reading list (**spreadsheet in progress**), narrowing it down to books that goodreads scores a 4 or higher. Feel free to peek: [https://docs.google.com/spreadsheets/d/1Nb7qh78VMGvoabh\\_C2sXCDGEnwR3IrnvhLMcx3dwCyE/edit#gid=0](https://docs.google.com/spreadsheets/d/1Nb7qh78VMGvoabh_C2sXCDGEnwR3IrnvhLMcx3dwCyE/edit#gid=0) \n\nthank you for taking the time to reminiscence and contribute. "}, {"title": "we are now in the middle of a globalist takeover", "body": "the internet is being cencored more day by day. MSM is paid and bought to push a globalist agenda. The crash of the world economy is imminent. more countrys are holding unvaxxed in house arrest. the free world is lost because to many of us did not care to educate themself and spent most of theire freetime procrastinating on SOME. and nobody seem to notice it"}, {"title": "Trump faces legal challenges in keeping documents from Jan. 6 committee", "body": ""}, {"title": "Jon Gruden sues NFL for forced resignation. \"The NFL and Commissioner Roger Goodell sought to destroy the career and reputation of Jon Gruden\" by threatening to, and then leaking, emails to the New York Times.", "body": ""}, {"title": "FDA Alert: 2 Million COVID-19 Tests Recalled Over False Positives", "body": ""}, {"title": "Good News! Data out of Israel says the booster shot offers \"at least\" 12 days of extra protection.", "body": "**Source:** https://www.nytimes.com/2021/09/15/health/covid-booster-shot-data.html\n\nSavor that almost two weeks of enhanced antibody goodness!"}, {"title": "[PIC] The sweetest little needle minders 🥰", "body": ""}, {"title": "I finished my first ever stuffed animal!", "body": ""}, {"title": "My first CraftyIntentions pattern is done! Behold, my faerie dragon!", "body": ""}, {"title": "Even if you vaxxed every man, woman, child, and animal on the planet you still wouldn't achieve \"herd immunity\" with these leaky vaccines. Like Bill Gates said recently, they only \"slightly\" prevent transmission, meaning almost not at all. There is zero reason to force vaccinate anyone not at risk", "body": ""}, {"title": "My 4th practice flower finally looks good… may the giant flower blanket commence.", "body": ""}, {"title": "I’m completely obsessed with this stitch pattern. So easy but so satisfying.", "body": ""}, {"title": "First of the Christmas present throws finished!", "body": ""}, {"title": "Finally 50% done my fiance's Christmas gift... From 2020 🤣 (open the picture for the full scarf - I had to take the picture as a panorama)", "body": ""}, {"title": "[FO] keep your hands clean and your mind dirty (AlitonEmbroidery, Etsy)", "body": ""}, {"title": "A protest for freedom has been planned for November 20th in Australia. Australians must resist the tyranny being forced on them.", "body": ""}, {"title": "I just finished making this!", "body": ""}, {"title": "Made a wearable for my daughter, but waited a little too long to try it on! Oops! Anyway, here’s a newborn cardigan, no pattern used", "body": ""}, {"title": "do self-help books work?", "body": "Everyone is talking about them. I have only read one (the subtle art of not giving a f) and it changed nothing. It feels like a motivational speech where the moment it ends the moment the magic stops. I feel like the authors are already achieved success and it’s “so easy them to say” to someone who’s struggling. They don’t feel sincere when they give me a list of things to do. Just do these and you’ll be great!\nIt’s hard for someone who only believe themselves partly."}, {"title": "Harsh Times by Mario Vargas Llosa is worth the read if you're into historical fiction set in Latin America", "body": "I was browsing r/books a moment when I saw the book featured on the left-hand side of this subreddit under \"New Release\". It's set to come out later this month in English, but I read it when it first came out in Spanish and it's probably my second favorite book written by this author(my first is probably The Feast of the Goat).  I also felt compelled to write this since some users were asking about contemporary authors who aren't just Marquez or Cervantez. In the link below, it's my second comment:\n\nhttps://old.reddit.com/r/books/comments/qrtfxd/what_happened_to_russian_literature_why_we_dont/hk9sbo0/\n\nAnyways, Harsh Times is historical fiction, but it's also based on actual events that you can Vargas Llosa spent a great deal of time researching. The story takes place in Guatemala in the 50s at the time when one of its presidents wanted to turn Guatemala into a modern democracy like the US. At the time, the country was ruled in a very feudalistic manner where a few people owned most of the land and most of the population, mostly indigenous, were tied to it. In order to achieve his goal, he also needed to do land reform so that unused land could be used by these people who would become the basis for the middle class. One of the groups opposing this was the United Fruit Company who is also mentioned in One Hundred Years of Solitude. \n\nPrior to the book being released, I watched an interview where the author talked about misinformation campaigns and it's one of the reasons why he wrote this book. The United Fruit Company used their resources and money to launch a massive misinformation campaign in Guatemala and in the US to make people along with the government and CIA, believe that this president was actually a communist who wanted to turn the country into a client state of the Soviet Union. The end result is a coup supported by the US, the first of its kind in Latin America. The book focuses on various people during this time period and what happens immediately after the coup. It also features certain characters from The Feast of the Goat who were also in Guatemala during this time period as well and played an active role in what happened. \n\nI really enjoyed this book since I enjoy more historical books so I amped that others will be able to finally read it. It helped me to understand the current day Guatemala better. The end of the book was also interesting. It features an interview with one of the characters who worked with the CIA and is living somewhere in the US. After the interview, there's this mini-reflection where the VL thinks back on the events that occurred there. He also tries to make the connection between that coup and how the Cuban Revolution would eventually play out just a few years after this book takes place."}, {"title": "[WIP] I'm stitching on the bag (shopper) for the first time. It will be the Antique Sculpture. And I have a helper!", "body": ""}, {"title": "[WIP] Cryptid SAL 5/16: El Chupacabra! A little behind but still loving every new pattern", "body": ""}, {"title": "I’m the best version I’ve ever been, so why does it feel fake how others see me?", "body": "I’m currently living and working abroad and for the first time in my life I feel great just being myself. I’m a very chatty person which has always been criticised but now it’s encouraged by my friends and colleagues, I’m often out take advantage of my time here sight seeing, hiking or just enjoying nature. It’s the first time since I was a kid that I don’t have to hold myself back or turn down my personality and somehow now I feel like I’m fake or at least that the way others describe me is wrong 😅 like that person is pretty much perfect and they’re technically right in the things they say about me 😅 is it just because we’re always used to only hear about the worst sites of us from “friends”? Or is it some kind of imposter syndrome? 🤔"}, {"title": "Asked about 'hang Mike Pence' chant, Trump gives the wrong answer", "body": ""}, {"title": "Everything annoys me now.", "body": "Since being awakened not only do I feel the anxiety of knowing more about what’s going on, I am questioning everything. And being annoyed by the shiny objects that they try to distract us with. I met someone today who had scented shoes. Shoes. Funny yes the joke of let me smell your feet I get it but this stuff is just distraction. And passing a car lot I saw they now have the ‘22 models in stock. The car is not really a ‘22 model. It was made either this year or prior. It’s just a label. Who knows when it was made! But it’s just little games to make us feel like we have power. Everyday the veil lifts more and I see the constant nonsense around us."}, {"title": "Here’s one. Doctors along with the massive pharmaceutical companies involved with insulin are keeping type 2 diabetics hooked on medications that they do not need because they profit from chronic illnesses. Type 2 diabetes is completely reversible.", "body": ""}, {"title": "Big pharma paid for corporate media blames spike in heart attacks from jab on weed.", "body": "Big pharma paid for corporate media blames spike in heart attacks from jab on weed. A bunch of athletes and kids aren't smoking weed to the point of heart attacks.\n\n[https://whdh.com/news/cannabis-use-disorder-may-be-linked-to-growing-number-of-heart-attacks-in-younger-adults/](https://whdh.com/news/cannabis-use-disorder-may-be-linked-to-growing-number-of-heart-attacks-in-younger-adults/)"}, {"title": "Why do people care about federal laws on social issues like weed or abortion?", "body": "I understand that this isn't feasible for someone if they think that abortion is murder. It's kind of like \"why not let people own slaves in their own state\" that's why this question is mostly for people who perceive these issues as largely subjective and are concerned about the utilitarian aspect of the policies.\n\nIf states have the opportunity to run diverse sets of laws that the majority of people in those states want to live under then why not let them run their own experiment in order to find out more about the policy and its outcomes. Is the principle certainty that the policy will work better for every state or is it just a deontological belief about freedom or something else I'm missing?"}, {"title": "Why is it that sheeple are so rude?", "body": "I cant believe my eyes when Im scrolling through other subs. \n\nIts almost like they are not my species anymore. Saying things like\n\"I have no pity for any unvaxxed that dies\"\netc etc.\n\nI mean like WTF? In their clownworld they are safe because of the vaxx. So whats the problem with other opinions?"}, {"title": "[FO] autumn napkin 5 of 5", "body": ""}, {"title": "‘I was thinking about trying to stab a person’: Rep Ruben Gallego on how his US Marine instincts kicked in during Capitol riot", "body": ""}, {"title": "[FO] \"Blow Me\" Pattern by Kwagnerxstitch", "body": ""}, {"title": "Mom's for Liberty", "body": ""}, {"title": "My first skull shawl 😍❤️", "body": ""}]